QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5190_Reg.h
/*----------------------------------------------------------------------------*/
/* Copyright 2019-2022 NXP                                                    */
/*                                                                            */
/* NXP Confidential. This software is owned or controlled by NXP and may only */
/* be used strictly in accordance with the applicable license terms.          */
/* By expressly accepting such terms or by downloading, installing,           */
/* activating and/or otherwise using the software, you are agreeing that you  */
/* have read, and that you agree to comply with and are bound by, such        */
/* license terms. If you do not agree to be bound by the applicable license   */
/* terms, then you may not retain, install, activate or otherwise use the     */
/* software.                                                                  */
/*----------------------------------------------------------------------------*/

/** \file
* PN5190 HAL Register definition header file.
*
* $Author$
* $Revision$ (v07.13.00)
* $Date$
*/

#ifndef PHHALHW_PN5190_REG_H_
#define PHHALHW_PN5190_REG_H_

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#ifdef NXPBUILD__PHHAL_HW_PN5190

#define MASK_TX_LASTBITS                                                                                 0x07U    /**< The bits that are valid for TX_LATS_BITS field */
#define MASK_RX_LASTBITS                                                                                 0x07U    /**< The bits that are valid for RX_LATS_BITS field */
#define MASK_RXWAIT                                                                                      0xFFFFFU/**< Bitmask for RxWait bits. */

#define SYSTEM_CONFIG                                                                                     0x0
#define SYSTEM_CONFIG_TX_NOV_CALIBRATE_POS                                                               (8UL)
#define SYSTEM_CONFIG_TX_NOV_CALIBRATE_MASK                                                              (0x00000100UL)  /**< 0-*/
#define SYSTEM_CONFIG_RFU_POS                                                                            (7UL)
#define SYSTEM_CONFIG_RFU_MASK                                                                           (0x00000080UL)  /**< 7-Reserved */
#define SYSTEM_CONFIG_15693_CHANGE_DATARATE_POS                                                          (5UL)
#define SYSTEM_CONFIG_15693_CHANGE_DATARATE_MASK                                                         (0x00000060UL)  /**< 0-0 - RFU
1 - Change Data Rate to 53kB/sec
2 -  Change Data Rate to 106kB/sec
3 -  Change Data Rate to 212kB/sec*/
#define SYSTEM_CONFIG_RESERVED_POS                                                                       (4UL)
#define SYSTEM_CONFIG_RESERVED_MASK                                                                      (0x00000010UL)  /**< -*/
#define SYSTEM_CONFIG_AUTOCOLL_STATE_A_POS                                                               (3UL)
#define SYSTEM_CONFIG_AUTOCOLL_STATE_A_MASK                                                              (0x00000008UL)  /**< 0-*/
#define SYSTEM_CONFIG_SOFT_RESET_POS                                                                     (2UL)
#define SYSTEM_CONFIG_SOFT_RESET_MASK                                                                    (0x00000004UL)  /**< 0-*/
#define SYSTEM_CONFIG_MFC_CRYPTO_ON_POS                                                                  (1UL)
#define SYSTEM_CONFIG_MFC_CRYPTO_ON_MASK                                                                 (0x00000002UL)  /**< 8-If set to 1 the mfc-crypto bit is generated for end-/de-cryption*/
#define SYSTEM_CONFIG_PRBS_TYPE_POS                                                                      (0UL)
#define SYSTEM_CONFIG_PRBS_TYPE_MASK                                                                     (0x00000001UL)  /**< 20-Defines the PRBS type. If set to 1 PRBS15 is selected default value 0 selects PRBS9*/

#define EVENT_ENABLE                                                                                      0x1
#define EVENT_ENABLE_RFU_POS                                                                             (12UL)
#define EVENT_ENABLE_RFU_MASK                                                                            (0xFFFFF000UL)  /**< 12-Enable the corresponding event*/
#define EVENT_ENABLE_CTS_EVENT_ENABLE_POS                                                                (11UL)
#define EVENT_ENABLE_CTS_EVENT_ENABLE_MASK                                                               (0x00000800UL)  /**< 11-Enable the corresponding event*/
#define EVENT_ENABLE_IDLE_EVENT_ENABLE_POS                                                               (10UL)
#define EVENT_ENABLE_IDLE_EVENT_ENABLE_MASK                                                              (0x00000400UL)  /**< 10-Enable the corresponding event*/
#define EVENT_ENABLE_LP_CALIBRATION_EVENT_ENABLE_POS                                                     (9UL)
#define EVENT_ENABLE_LP_CALIBRATION_EVENT_ENABLE_MASK                                                    (0x00000200UL)  /**< 9-Enable the corresponding event*/
#define EVENT_ENABLE_LPCD_EVENT_ENABLE_POS                                                               (8UL)
#define EVENT_ENABLE_LPCD_EVENT_ENABLE_MASK                                                              (0x00000100UL)  /**< 8-Enable the corresponding event*/
#define EVENT_ENABLE_AUTOCOLL_EVENT_ENABLE_POS                                                           (7UL)
#define EVENT_ENABLE_AUTOCOLL_EVENT_ENABLE_MASK                                                          (0x00000080UL)  /**< 7-Enable the corresponding event*/
#define EVENT_ENABLE_TIMER0_EVENT_ENABLE_POS                                                             (6UL)
#define EVENT_ENABLE_TIMER0_EVENT_ENABLE_MASK                                                            (0x00000040UL)  /**< 6-Enable the corresponding event*/
#define EVENT_ENABLE_TEMP_ERROR_EVENT_ENABLE_POS                                                         (5UL)
#define EVENT_ENABLE_TEMP_ERROR_EVENT_ENABLE_MASK                                                        (0x00000020UL)  /**< 5-Enable the corresponding event*/
#define EVENT_ENABLE_RFON_DET_EVENT_ENABLE_POS                                                           (4UL)
#define EVENT_ENABLE_RFON_DET_EVENT_ENABLE_MASK                                                          (0x00000010UL)  /**< 4-Enable the corresponding event*/
#define EVENT_ENABLE_RFOFF_DET_EVENT_ENABLE_POS                                                          (3UL)
#define EVENT_ENABLE_RFOFF_DET_EVENT_ENABLE_MASK                                                         (0x00000008UL)  /**< 3-Enable the corresponding event*/
#define EVENT_ENABLE_STANDBY_PREV_EVENT_ENABLE_POS                                                       (2UL)
#define EVENT_ENABLE_STANDBY_PREV_EVENT_ENABLE_MASK                                                      (0x00000004UL)  /**< 2-Enable the corresponding event*/
#define EVENT_ENABLE_GENERAL_ERROR_EVENT_ENABLE_POS                                                      (1UL)
#define EVENT_ENABLE_GENERAL_ERROR_EVENT_ENABLE_MASK                                                     (0x00000002UL)  /**< 1-Enable the corresponding event*/
#define EVENT_ENABLE_BOOT_EVENT_ENABLE_POS                                                               (0UL)
#define EVENT_ENABLE_BOOT_EVENT_ENABLE_MASK                                                              (0x00000001UL)  /**< 0-Enable the corresponding event*/

#define EVENT_STATUS                                                                                      0x2
#define EVENT_STATUS_RFU_POS                                                                             (12UL)
#define EVENT_STATUS_RFU_MASK                                                                            (0xFFFFF000UL)  /**< 12-Reserved */
#define EVENT_STATUS_CTS_EVENT_POS                                                                       (11UL)
#define EVENT_STATUS_CTS_EVENT_MASK                                                                      (0x00000800UL)  /**< 11-Indicated the availablilty of CTS Event*/
#define EVENT_STATUS_IDLE_EVENT_POS                                                                      (10UL)
#define EVENT_STATUS_IDLE_EVENT_MASK                                                                     (0x00000400UL)  /**< 10-Indicated the availability of IDLE event.*/
#define EVENT_STATUS_LP_CALIBRATION_EVENT_POS                                                            (9UL)
#define EVENT_STATUS_LP_CALIBRATION_EVENT_MASK                                                           (0x00000200UL)  /**< 9-Indicated the availability of LP Calibration event*/
#define EVENT_STATUS_LPCD_EVENT_POS                                                                      (8UL)
#define EVENT_STATUS_LPCD_EVENT_MASK                                                                     (0x00000100UL)  /**< 8-Indicated the availability of LPCD event.*/
#define EVENT_STATUS_AUTOCOLL_EVENT_POS                                                                  (7UL)
#define EVENT_STATUS_AUTOCOLL_EVENT_MASK                                                                 (0x00000080UL)  /**< 7-Indicated the availability of Autocoll event*/
#define EVENT_STATUS_TIMER0_EVENT_POS                                                                    (6UL)
#define EVENT_STATUS_TIMER0_EVENT_MASK                                                                   (0x00000040UL)  /**< 6-Indicated the availability of Timer0 event*/
#define EVENT_STATUS_TEMP_ERROR_EVENT_POS                                                                (5UL)
#define EVENT_STATUS_TEMP_ERROR_EVENT_MASK                                                               (0x00000020UL)  /**< 5-Indicated the availability of Temp error*/
#define EVENT_STATUS_RFON_DET_EVENT_POS                                                                  (4UL)
#define EVENT_STATUS_RFON_DET_EVENT_MASK                                                                 (0x00000010UL)  /**< 4-Indicated the availability of RF ON detected*/
#define EVENT_STATUS_RFOFF_DET_EVENT_POS                                                                 (3UL)
#define EVENT_STATUS_RFOFF_DET_EVENT_MASK                                                                (0x00000008UL)  /**< 3-Indicated the availability of Boot event.RF OFF detected*/
#define EVENT_STATUS_STANDBY_PREV_EVENT_POS                                                              (2UL)
#define EVENT_STATUS_STANDBY_PREV_EVENT_MASK                                                             (0x00000004UL)  /**< 2-Indicated the availability of Standby Prevention reason.*/
#define EVENT_STATUS_GENERAL_ERROR_EVENT_POS                                                             (1UL)
#define EVENT_STATUS_GENERAL_ERROR_EVENT_MASK                                                            (0x00000002UL)  /**< 1-Indicated the availability of General Error event.*/
#define EVENT_STATUS_BOOT_EVENT_POS                                                                      (0UL)
#define EVENT_STATUS_BOOT_EVENT_MASK                                                                     (0x00000001UL)  /**< 0-Indicated the availability of Boot event.*/

#define EMD_CONTROL                                                                                       0x3
#define EMD_CONTROL_EMD_RM_EMD_SENSITIVITY_POS                                                           (10UL)
#define EMD_CONTROL_EMD_RM_EMD_SENSITIVITY_MASK                                                          (0x00000C00UL)  /**< 10-RM EMD SENSITIVITY value that will be applied to SIGPRO_RM_CONFIG*/
#define EMD_CONTROL_EMD_TRANSMISSION_TIMER_USED_POS                                                      (8UL)
#define EMD_CONTROL_EMD_TRANSMISSION_TIMER_USED_MASK                                                     (0x00000300UL)  /**< 8-Timer used for RF communication. */
#define EMD_CONTROL_EMD_MISSING_CRC_IS_PROTOCOL_ERROR_TYPE_B_POS                                         (7UL)
#define EMD_CONTROL_EMD_MISSING_CRC_IS_PROTOCOL_ERROR_TYPE_B_MASK                                        (0x00000080UL)  /**< 7-Missing CRC treated as protocol error in case of Type B based communication*/
#define EMD_CONTROL_EMD_MISSING_CRC_IS_PROTOCOL_ERROR_TYPE_A_POS                                         (6UL)
#define EMD_CONTROL_EMD_MISSING_CRC_IS_PROTOCOL_ERROR_TYPE_A_MASK                                        (0x00000040UL)  /**< 6-Missing CRC treated as protocol error in case of Type A based communication*/
#define EMD_CONTROL_EMD_NOISE_BYTES_THRESHOLD_POS                                                        (2UL)
#define EMD_CONTROL_EMD_NOISE_BYTES_THRESHOLD_MASK                                                       (0x0000003CUL)  /**< 2-Defines the threshold under which transmission errors are treated as noise. Note: CRC bytes are NOT included/counted!*/
#define EMD_CONTROL_EMD_TRANSMISSION_ERROR_ABOVE_NOISE_THRESHOLD_IS_NO_EMD_POS                           (1UL)
#define EMD_CONTROL_EMD_TRANSMISSION_ERROR_ABOVE_NOISE_THRESHOLD_IS_NO_EMD_MASK                          (0x00000002UL)  /**< 1-Transmission errors with received byte length >= EMD_NOISE_BYTES_THRESHOLD is never treated as EMD (EMVCo 2.5 standard)*/
#define EMD_CONTROL_EMD_ENABLE_POS                                                                       (0UL)
#define EMD_CONTROL_EMD_ENABLE_MASK                                                                      (0x00000001UL)  /**< 0-EMD handling enabled*/

#define FELICA_EMD_CONTROL                                                                                0x4
#define FELICA_EMD_CONTROL_FELICA_EMD_RC_BYTE_VALUE_POS                                                  (24UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_RC_BYTE_VALUE_MASK                                                 (0xFF000000UL)  /**< 24-RC byte value that needs to be received to not treat the frame as EMD*/
#define FELICA_EMD_CONTROL_FELICA_EMD_LENGTH_BYTE_MAX_POS                                                (16UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_LENGTH_BYTE_MAX_MASK                                               (0x00FF0000UL)  /**< 16-Maximum Length byte value that needs to be received to not treat the frame as EMD*/
#define FELICA_EMD_CONTROL_FELICA_EMD_LENGTH_BYTE_MIN_POS                                                (8UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_LENGTH_BYTE_MIN_MASK                                               (0x0000FF00UL)  /**< 8-Minimum Length byte value that needs to be received to not treat the frame as EMD*/
#define FELICA_EMD_CONTROL_RESERVED_POS                                                                  (7UL)
#define FELICA_EMD_CONTROL_RESERVED_MASK                                                                 (0x00000080UL)  /**< 7-Reserved */
#define FELICA_EMD_CONTROL_FELICA_EMD_LOG_ENABLE_POS                                                     (6UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_LOG_ENABLE_MASK                                                    (0x00000040UL)  /**< 6-Log Enable bit to send Rx Status during EMD */
#define FELICA_EMD_CONTROL_FELICA_EMD_RC_CHECK_ON_CRC_CORRECT_ENABLE_POS                                 (5UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_RC_CHECK_ON_CRC_CORRECT_ENABLE_MASK                                (0x00000020UL)  /**< 5-RC byte check enabled for FeliCa EMD handling when there is no Integrity Error observed */
#define FELICA_EMD_CONTROL_FELICA_EMD_INTEGRITY_ERR_CHECK_ENABLE_POS                                     (4UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_INTEGRITY_ERR_CHECK_ENABLE_MASK                                    (0x00000010UL)  /**< 4-FeliCa EMD handling enabled when integrity error is set*/
#define FELICA_EMD_CONTROL_FELICA_EMD_PROTOCOL_ERR_CHECK_ENABLE_POS                                      (3UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_PROTOCOL_ERR_CHECK_ENABLE_MASK                                     (0x00000008UL)  /**< 3-FeliCa EMD handling enabled when protocol error is set*/
#define FELICA_EMD_CONTROL_FELICA_EMD_RC_CHECK_ENABLE_POS                                                (2UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_RC_CHECK_ENABLE_MASK                                               (0x00000004UL)  /**< 2-RC byte check enabled for FeliCa EMD handling */
#define FELICA_EMD_CONTROL_FELICA_EMD_LEN_CHECK_ENABLE_POS                                               (1UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_LEN_CHECK_ENABLE_MASK                                              (0x00000002UL)  /**< 1-Length byte check enabled for FeliCa EMD handling*/
#define FELICA_EMD_CONTROL_FELICA_EMD_ENABLE_POS                                                         (0UL)
#define FELICA_EMD_CONTROL_FELICA_EMD_ENABLE_MASK                                                        (0x00000001UL)  /**< 0-FeliCa EMD handling enabled*/

