QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5190_Reg.h
#define CLIF_RX_STATUS                                                                                    0x5
#define CLIF_RX_STATUS_RESERVED_POS                                                                      (27UL)
#define CLIF_RX_STATUS_RESERVED_MASK                                                                     (0xF8000000UL)  /**< 27-Reserved*/
#define CLIF_RX_STATUS_RX_COLL_POS_POS                                                                   (20UL)
#define CLIF_RX_STATUS_RX_COLL_POS_MASK                                                                  (0x07F00000UL)  /**< 20-Status indicating the bit position of the first collision detected in the data bit. The value is valid only when RX_COLLISION_DETECTED==1. The value of the RX_BIT_ALIGN is also taken intoaccount (RX_COLL_POS = physical bit position in the flow + RX_BIT_ALIGN value).Indicates the collision position in the first 8 bytes only. Can be used during the TypeA/ICODE/EPC anticollision procedure.0x00 - 1st bit 0x01 - 2nd bit...0x7F - 128th bit.The status register is not updated by the collision detected on stop or parity bit.*/
#define CLIF_RX_STATUS_RX_NUM_LAST_BITS_POS                                                              (17UL)
#define CLIF_RX_STATUS_RX_NUM_LAST_BITS_MASK                                                             (0x000E0000UL)  /**< 17-Status indicating the number of valid bits in the last byte written to the System RAM.0x0 - all bits are valid 0x1 - 1 bit is valid...0x7 - 7 bits are valid*/
#define CLIF_RX_STATUS_RX_NUM_FRAMES_RECEIVED_POS                                                        (13UL)
#define CLIF_RX_STATUS_RX_NUM_FRAMES_RECEIVED_MASK                                                       (0x0001E000UL)  /**< 13-Indicates the number of frames received. The value is updated after every normal frame reception in RX_MULTIPLE mode.The value is valid only if the bit RX_MULTIPLE_ENABLE==1.*/
#define CLIF_RX_STATUS_RX_NUM_BYTES_RECEIVED_POS                                                         (0UL)
#define CLIF_RX_STATUS_RX_NUM_BYTES_RECEIVED_MASK                                                        (0x00001FFFUL)  /**< 0-Status indicating the number of bytes written to the System RAM.0x0000 - no data0x0001 - 1 byte...0x1000 - 4K bytes.0x1001 - 0x1FFF - not supported*/

#define CLIF_RX_STATUS_ERROR                                                                              0x6
#define CLIF_RX_STATUS_ERROR_RESERVED_POS                                                                (30UL)
#define CLIF_RX_STATUS_ERROR_RESERVED_MASK                                                               (0xC0000000UL)  /**< 30-Reserved*/
#define CLIF_RX_STATUS_ERROR_EMD_DETECTED_IN_RXDEC_POS                                                   (29UL)
#define CLIF_RX_STATUS_ERROR_EMD_DETECTED_IN_RXDEC_MASK                                                  (0x20000000UL)  /**< 29-The high level indicates that the EMD was detected (in the SigPro or in the RxDecoder or in both) during the reception.*/
#define CLIF_RX_STATUS_ERROR_EMD_DETECTED_IN_SIGPRO_POS                                                  (28UL)
#define CLIF_RX_STATUS_ERROR_EMD_DETECTED_IN_SIGPRO_MASK                                                 (0x10000000UL)  /**< 28-The high level indicates that the EMD was detected on the Physical layer (in the SigPro) during the reception.*/
#define CLIF_RX_STATUS_ERROR_EXT_RFOFF_DETECTED_POS                                                      (27UL)
#define CLIF_RX_STATUS_ERROR_EXT_RFOFF_DETECTED_MASK                                                     (0x08000000UL)  /**< 27-The high level indicates that the external RF-field vanished during the reception.*/
#define CLIF_RX_STATUS_ERROR_RX_FRAME_MAXLEN_VIOL_POS                                                    (26UL)
#define CLIF_RX_STATUS_ERROR_RX_FRAME_MAXLEN_VIOL_MASK                                                   (0x04000000UL)  /**< 26-The high level indicates that the received frame length violated the configured maximum limit.*/
#define CLIF_RX_STATUS_ERROR_RX_FRAME_MINLEN_VIOL_POS                                                    (25UL)
#define CLIF_RX_STATUS_ERROR_RX_FRAME_MINLEN_VIOL_MASK                                                   (0x02000000UL)  /**< 25-The high level indicates that the received frame length violated the configured minimum limit.*/
#define CLIF_RX_STATUS_ERROR_RX_FRAME_LE_CRC_POS                                                         (24UL)
#define CLIF_RX_STATUS_ERROR_RX_FRAME_LE_CRC_MASK                                                        (0x01000000UL)  /**< 24-The high level indicates that the received frame length is less or equal to the expected CRC field length.*/
#define CLIF_RX_STATUS_ERROR_RX_NOT_FULL_BYTE_POS                                                        (23UL)
#define CLIF_RX_STATUS_ERROR_RX_NOT_FULL_BYTE_MASK                                                       (0x00800000UL)  /**< 23-The high level indicates that the last received character in the frame has less than 8 bits.*/
#define CLIF_RX_STATUS_ERROR_RX_MISSING_PARBIT_DETECTED_POS                                              (22UL)
#define CLIF_RX_STATUS_ERROR_RX_MISSING_PARBIT_DETECTED_MASK                                             (0x00400000UL)  /**< 22-The high level indicates that the last received character in the frame has 8 data bits but the expected parity bit is absent.*/
#define CLIF_RX_STATUS_ERROR_RX_MISSING_STOPBIT_DETECTED_POS                                             (21UL)
#define CLIF_RX_STATUS_ERROR_RX_MISSING_STOPBIT_DETECTED_MASK                                            (0x00200000UL)  /**< 21-The high level indicates that the last received character in the frame has 8 data bits but the expected stop bit is absent.*/
#define CLIF_RX_STATUS_ERROR_RX_COLLISION_PARBIT_DETECTED_POS                                            (20UL)
#define CLIF_RX_STATUS_ERROR_RX_COLLISION_PARBIT_DETECTED_MASK                                           (0x00100000UL)  /**< 20-The high level indicates that the collision was detected on the parity bit position.*/
#define CLIF_RX_STATUS_ERROR_RX_COLLISION_STOPBIT_DETECTED_POS                                           (19UL)
#define CLIF_RX_STATUS_ERROR_RX_COLLISION_STOPBIT_DETECTED_MASK                                          (0x00080000UL)  /**< 19- The high level indicates that the collision was detected on the stop bit position.*/
#define CLIF_RX_STATUS_ERROR_RX_COLLISION_DETECTED_POS                                                   (18UL)
#define CLIF_RX_STATUS_ERROR_RX_COLLISION_DETECTED_MASK                                                  (0x00040000UL)  /**< 18-The high level indicates that the collision was detected during the frame reception.*/
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_RXOVER_POS                                                       (17UL)
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_RXOVER_MASK                                                      (0x00020000UL)  /**< 17-The high level indicates that the frame reception was stopped by SGP_MSG_RXOVER_* message reception.*/
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_RFOFF_POS                                                        (16UL)
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_RFOFF_MASK                                                       (0x00010000UL)  /**< 16-The high level indicates that the frame reception was interrupted by external RF-field vanishing event.*/
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_ERR_POS                                                          (15UL)
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_ERR_MASK                                                         (0x00008000UL)  /**< 15-The high level indicates that the frame reception was stopped by detected communication error event.*/
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_LEN_POS                                                          (14UL)
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_LEN_MASK                                                         (0x00004000UL)  /**< 14-The high level indicates that the frame reception was normally stopped by byte counter expiration event. Relates to the protocols where the LEN field is used in the frame format (Felica RM/CM, FWEC RM/CM).*/
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_INVPAR_POS                                                       (13UL)
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_INVPAR_MASK                                                      (0x00002000UL)  /**< 13-The high level indicates that the frame reception was normally stopped by the inverted parity detection event. Relates to the TypeA RM 212-848 kbps modes. 12 RX_STOP_ON_PATTERN R 0h The high level indicates that the frame reception was normally stopped by EOF pattern detection event. Relates to the TypeB RM/CM, B prime RM/CM modes.*/
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_PATTERN_POS                                                      (12UL)
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_PATTERN_MASK                                                     (0x00001000UL)  /**< 12-The high level indicates that the frame reception was normally stopped by EOF pattern detection event. Relates to the TypeB RM/CM, B prime RM/CM modes.*/
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_ANTICOLL_POS                                                     (11UL)
#define CLIF_RX_STATUS_ERROR_RX_STOP_ON_ANTICOLL_MASK                                                    (0x00000800UL)  /**< 11-The high level indicates that the frame reception was normally stopped by collision detected on data bit position. Relates to the bit-oriented frame reception in TypeA RM 106 kbps mode during the anticollision procedure.*/
#define CLIF_RX_STATUS_ERROR_RX_CRC_ERROR_POS                                                            (10UL)
#define CLIF_RX_STATUS_ERROR_RX_CRC_ERROR_MASK                                                           (0x00000400UL)  /**< 10-The high level indicates that the CRC error is detected in the received frame.*/
#define CLIF_RX_STATUS_ERROR_RX_LEN_ERROR_POS                                                            (9UL)
#define CLIF_RX_STATUS_ERROR_RX_LEN_ERROR_MASK                                                           (0x00000200UL)  /**< 9-The high level is set if the received frame is shorter than the length stated in the received frame LEN field OR if the LEN parameter in the received frame violates the configured [RX_FRAME_MINLEN:RX_FRAME_MAX LEN] limits. Can assert only in the mode swhere the LEN field is used in the frame format (Felica RM/CM, FWEC RM/CM).*/
#define CLIF_RX_STATUS_ERROR_RX_SIGPRO_ERROR_POS                                                         (8UL)
#define CLIF_RX_STATUS_ERROR_RX_SIGPRO_ERROR_MASK                                                        (0x00000100UL)  /**< 8-The high level indicates that the communication error/errors were detected during the frame reception on physical layer(in the SigPro).*/
#define CLIF_RX_STATUS_ERROR_RX_PARITY_ERROR_POS                                                         (7UL)
#define CLIF_RX_STATUS_ERROR_RX_PARITY_ERROR_MASK                                                        (0x00000080UL)  /**< 7-The high level indicates that the parity error was detected during the frame reception.*/
#define CLIF_RX_STATUS_ERROR_RX_STOPBIT_ERROR_POS                                                        (6UL)
#define CLIF_RX_STATUS_ERROR_RX_STOPBIT_ERROR_MASK                                                       (0x00000040UL)  /**< 6-The high level indicates that the stop bit error (0 level instead of 1 on the stop bit position) was detected during the frame reception.*/
#define CLIF_RX_STATUS_ERROR_RX_WRITE_ERROR_POS                                                          (5UL)
#define CLIF_RX_STATUS_ERROR_RX_WRITE_ERROR_MASK                                                         (0x00000020UL)  /**< 5-The high level indicates that the error acknowledge status was received on the CLIF-system interface during the received frame transmission to the System RAM.*/
#define CLIF_RX_STATUS_ERROR_RX_BUFFER_OVFL_ERROR_POS                                                    (4UL)
#define CLIF_RX_STATUS_ERROR_RX_BUFFER_OVFL_ERROR_MASK                                                   (0x00000010UL)  /**< 4-The high level indicates that the data payload length in the received frame exceeds the 28 bytes limit. Relates to the PollReq procedure in the Felica RM mode only.*/
#define CLIF_RX_STATUS_ERROR_RX_LATENCY_ERROR_POS                                                        (3UL)
#define CLIF_RX_STATUS_ERROR_RX_LATENCY_ERROR_MASK                                                       (0x00000008UL)  /**< 3-The high level indicates that the write request flow was corrupted due to traffic congestion on the system interface during the received frame transmission to the System RAM.*/
#define CLIF_RX_STATUS_ERROR_RX_DATA_INTEGRITY_ERROR_POS                                                 (2UL)
#define CLIF_RX_STATUS_ERROR_RX_DATA_INTEGRITY_ERROR_MASK                                                (0x00000004UL)  /**< 2-The high level indicates that the data integrity corruption (parity/CRC/etc error)was detected in the received frame.*/
#define CLIF_RX_STATUS_ERROR_RX_PROTOCOL_ERROR_POS                                                       (1UL)
#define CLIF_RX_STATUS_ERROR_RX_PROTOCOL_ERROR_MASK                                                      (0x00000002UL)  /**< 1-The high level indicates that the protocol requirements violation (stop bit error,missing parity bit, not full byte received, etc) was detected in the received frame.*/
#define CLIF_RX_STATUS_ERROR_RX_CL_ERROR_POS                                                             (0UL)
#define CLIF_RX_STATUS_ERROR_RX_CL_ERROR_MASK                                                            (0x00000001UL)  /**< 0-The high level indicates that some protocol/data integrity erorr/errors were detected during the frame reception*/

#define CLIF_STATUS                                                                                       0x7
#define CLIF_STATUS_RESERVED_POS                                                                         (30UL)
#define CLIF_STATUS_RESERVED_MASK                                                                        (0xC0000000UL)  /**< 30-Reserved */
#define CLIF_STATUS_CRC_OK_POS                                                                           (29UL)
#define CLIF_STATUS_CRC_OK_MASK                                                                          (0x20000000UL)  /**< 29-This bit indicates the status of the actual CRC calculation. If 1 the CRC is correct. meaning the CRC register has the value 0 or the residue value if inverted CRC is used. Note: This flag should only by evaluated at the end of a communication */
#define CLIF_STATUS_RX_SC_DETECTED_POS                                                                   (28UL)
#define CLIF_STATUS_RX_SC_DETECTED_MASK                                                                  (0x10000000UL)  /**< 28-Status signal indicating that a sub-carrier is detected.*/
#define CLIF_STATUS_RX_SOF_DETECTED_POS                                                                  (27UL)
#define CLIF_STATUS_RX_SOF_DETECTED_MASK                                                                 (0x08000000UL)  /**< 27-Status signal indicating that a SOF has been detected.*/
#define CLIF_STATUS_TX_RF_STATUS_POS                                                                     (26UL)
#define CLIF_STATUS_TX_RF_STATUS_MASK                                                                    (0x04000000UL)  /**< 26-If set to 1 this bit indicates that the drivers are turned on. meaning an RF-Field is created by the device itself. */
#define CLIF_STATUS_RF_DET_STATUS_POS                                                                    (25UL)
#define CLIF_STATUS_RF_DET_STATUS_MASK                                                                   (0x02000000UL)  /**< 25-If set to 1 this bit indicates that an external RF-Field is detected by the rf level detectors (after digital filtering) */
#define CLIF_STATUS_ADC_Q_CLIPPING_POS                                                                   (24UL)
#define CLIF_STATUS_ADC_Q_CLIPPING_MASK                                                                  (0x01000000UL)  /**< 24-Indicates that the Q-Channel ADC has clipped (value 0 or 63), This bit is reset with Rx-reset (enabling of receiver).*/
#define CLIF_STATUS_ADC_I_CLIPPING_POS                                                                   (23UL)
#define CLIF_STATUS_ADC_I_CLIPPING_MASK                                                                  (0x00800000UL)  /**< 23-Indicates that the I-Channel ADC has clipped (value 0 or 63), This bit is reset with Rx-reset (enabling of receiver).*/
#define CLIF_STATUS_RESERVED1_POS                                                                        (12UL)
#define CLIF_STATUS_RESERVED1_MASK                                                                       (0x007FF000UL)  /**< 12-22 Reserved */
#define CLIF_STATUS_TX_NO_DATA_ERROR_POS                                                                 (11UL)
#define CLIF_STATUS_TX_NO_DATA_ERROR_MASK                                                                (0x00000800UL)  /**< 11-This error flag is set to 1. in case a transmission is started but no data is available (register NumBytesToSend == 0). */
#define CLIF_STATUS_RF_ACTIVE_ERROR_CAUSE_POS                                                            (8UL)
#define CLIF_STATUS_RF_ACTIVE_ERROR_CAUSE_MASK                                                           (0x00000700UL)  /**< 8-This status flag indicates the cause of an NFC-Active error. Note: This bits are only valid when the RF_ACTIVE_ERROR_IRQ is raised and will be cleared as soon as the bit TX_RF_ENABLE is set to 1. 0* No Error. reset value 1 External field was detected on within TIDT timing 2 External field was detected on within TADT timing 3 No external field was detected within TADT timings 4 Peer did switch off RFField without but no Rx event was raised (no data received) 5 - 7 Reserved.*/
#define CLIF_STATUS_RESERVED2_POS                                                                        (6UL)
#define CLIF_STATUS_RESERVED2_MASK                                                                       (0x000000C0UL)  /**< 6-Reserved */
#define CLIF_STATUS_RX_ENABLE_POS                                                                        (5UL)
#define CLIF_STATUS_RX_ENABLE_MASK                                                                       (0x00000020UL)  /**< 5-This bit indicates if the RxDecoder is enalbed. If 1 the RxDecoder was enabled by the Transceive Unit and is now ready for data reception */
#define CLIF_STATUS_TX_ACTIVE_POS                                                                        (4UL)
#define CLIF_STATUS_TX_ACTIVE_MASK                                                                       (0x00000010UL)  /**< 4-This bit indicates activity of the TxEncoder. If 1 a transmission is ongoing otherwise the TxEncoder is in idle state.*/
#define CLIF_STATUS_RX_ACTIVE_POS                                                                        (3UL)
#define CLIF_STATUS_RX_ACTIVE_MASK                                                                       (0x00000008UL)  /**< 3-This bit indicates activity of the RxDecoder. If 1 a data reception is ongoing. otherwise the RxDecoder is in idle state. */
#define CLIF_STATUS_TRANSCEIVE_STATE_POS                                                                 (0UL)
#define CLIF_STATUS_TRANSCEIVE_STATE_MASK                                                                (0x00000007UL)  /**< 0-This registers hold the command bits 0* IDLE state 1 WaitTransmit state 2 Transmitting state 3 WaitReceive state 4 WaitForData state 5 Receiving state 6 LoopBack state 7 reserved*/

#define CLIF_TRANSCEIVE_CONTROL                                                                           0x8
#define CLIF_TRANSCEIVE_CONTROL_RESERVED_POS                                                             (16UL)
#define CLIF_TRANSCEIVE_CONTROL_RESERVED_MASK                                                            (0xFFFF0000UL)  /**< 16-Reserved */
#define CLIF_TRANSCEIVE_CONTROL_TX_BITPHASE_POS                                                          (8UL)
#define CLIF_TRANSCEIVE_CONTROL_TX_BITPHASE_MASK                                                         (0x0000FF00UL)  /**< 8-15 Defines the number of 13.56MHz cycles used for adjustment of tx_wait to meet the FDT. */
#define CLIF_TRANSCEIVE_CONTROL_RESERVED1_POS                                                            (4UL)
#define CLIF_TRANSCEIVE_CONTROL_RESERVED1_MASK                                                           (0x000000F0UL)  /**< 4-14 Reserved */
#define CLIF_TRANSCEIVE_CONTROL_TX_FRAMESTEP_ENABLE_POS                                                  (3UL)
#define CLIF_TRANSCEIVE_CONTROL_TX_FRAMESTEP_ENABLE_MASK                                                 (0x00000008UL)  /**< 3-If set to 1. at every start of transmission. each byte of data is sent in a seperate frame. SOF and EOF is appended to the data byte according to the framing settings. After one byte is transmitted. the TxEncoder waits for a new start trigger to continue with the next byte. */
#define CLIF_TRANSCEIVE_CONTROL_RX_MULTIPLE_ENABLE_POS                                                   (2UL)
#define CLIF_TRANSCEIVE_CONTROL_RX_MULTIPLE_ENABLE_MASK                                                  (0x00000004UL)  /**< 2-If this bit is set to 1. the receiver is re-activated after the end of a reception. A statusbyte is written to the RAM containing all relevant status information of the frame. Note: Data in RAM is word aligned therefore empty bytes of a data Word in RAM are padded with 0x00 bytes. SW has to calculate the correct address for the following frame. */
#define CLIF_TRANSCEIVE_CONTROL_RESERVED2_POS                                                            (0UL)
#define CLIF_TRANSCEIVE_CONTROL_RESERVED2_MASK                                                           (0x00000003UL)  /**< 0-1 Reserved */

