QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5190_Reg.h
#define CLIF_TX_SYMBOL01_MOD                                                                              0x9
#define CLIF_TX_SYMBOL01_MOD_RESERVED_POS                                                                (24UL)
#define CLIF_TX_SYMBOL01_MOD_RESERVED_MASK                                                               (0xFF000000UL)  /**< 24-Reserved */
#define CLIF_TX_SYMBOL01_MOD_TX_S01_MODWIDTH_POS                                                         (16UL)
#define CLIF_TX_SYMBOL01_MOD_TX_S01_MODWIDTH_MASK                                                        (0x00FF0000UL)  /**< 16-Specifies the length of a pulse for sending data of symbol 0/1. The length is given by the number of carrier clocks + 1. */
#define CLIF_TX_SYMBOL01_MOD_RESERVED1_POS                                                               (9UL)
#define CLIF_TX_SYMBOL01_MOD_RESERVED1_MASK                                                              (0x0000FE00UL)  /**< 9-Reserved */
#define CLIF_TX_SYMBOL01_MOD_TX_S01_MILLER_ENABLE_POS                                                    (8UL)
#define CLIF_TX_SYMBOL01_MOD_TX_S01_MILLER_ENABLE_MASK                                                   (0x00000100UL)  /**< 8-If set to 1. pulse modulation is applied according to modified miller coding. */
#define CLIF_TX_SYMBOL01_MOD_TX_S01_INV_ENV_POS                                                          (7UL)
#define CLIF_TX_SYMBOL01_MOD_TX_S01_INV_ENV_MASK                                                         (0x00000080UL)  /**< 7-If set to 1. the output envelope is inverted. */
#define CLIF_TX_SYMBOL01_MOD_TX_S01_ENV_TYPE_POS                                                         (4UL)
#define CLIF_TX_SYMBOL01_MOD_TX_S01_ENV_TYPE_MASK                                                        (0x00000070UL)  /**< 4-Specifies the type of envelope used for transmission of data packets. The selected envelope type is applied to the pseudo bit stream. 000b Direct output 001b Manchester code 010b Manchster code with subcarrier 011b BPSK 100b RZ (pulse of half bit length at beginning of second half of bit) 101b RZ (pulse of half bit length at beginning of bit) 110b Manchester tupple 111b RFU*/
#define CLIF_TX_SYMBOL01_MOD_TX_S01_SC_FREQ_POS                                                          (3UL)
#define CLIF_TX_SYMBOL01_MOD_TX_S01_SC_FREQ_MASK                                                         (0x00000008UL)  /**< 3-Specifies the frequency of the subcarrier. 0 424 kHz 1 848 kHz */
#define CLIF_TX_SYMBOL01_MOD_TX_S01_BIT_FREQ_POS                                                         (0UL)
#define CLIF_TX_SYMBOL01_MOD_TX_S01_BIT_FREQ_MASK                                                        (0x00000007UL)  /**< 0-Specifies the frequency of the bit-stream.  000b -> 1.695 MHz. 001b -> Reserved. 010b -> 26 kHz. 011b -> 53 kHz. 100b -> 106 kHz. 101b -> 212 kHz. 110b -> 424 kHz. 111b -> 848 kHz.*/

#define CLIF_TX_SYMBOL1_DEF                                                                               0xA
#define CLIF_TX_SYMBOL1_DEF_TX_SYMBOL1_DEF_POS                                                           (0UL)
#define CLIF_TX_SYMBOL1_DEF_TX_SYMBOL1_DEF_MASK                                                          (0xFFFFFFFFUL)  /**< 0-Pattern definition for Symbol1 */

#define CLIF_TX_SYMBOL0_DEF                                                                               0xB
#define CLIF_TX_SYMBOL0_DEF_TX_SYMBOL0_DEF_POS                                                           (0UL)
#define CLIF_TX_SYMBOL0_DEF_TX_SYMBOL0_DEF_MASK                                                          (0xFFFFFFFFUL)  /**< 0-Pattern definition for Symbol0*/

#define CLIF_TX_SYMBOL23_MOD                                                                              0xC
#define CLIF_TX_SYMBOL23_MOD_RESERVED_POS                                                                (24UL)
#define CLIF_TX_SYMBOL23_MOD_RESERVED_MASK                                                               (0xFF000000UL)  /**< 24-Reserved */
#define CLIF_TX_SYMBOL23_MOD_TX_S23_MODWIDTH_POS                                                         (16UL)
#define CLIF_TX_SYMBOL23_MOD_TX_S23_MODWIDTH_MASK                                                        (0x00FF0000UL)  /**< 16-Specifies the length of a pulse for sending data of symbol 2/3. The length is given by the number of carrier clocks + 1.*/
#define CLIF_TX_SYMBOL23_MOD_RESERVED1_POS                                                               (9UL)
#define CLIF_TX_SYMBOL23_MOD_RESERVED1_MASK                                                              (0x0000FE00UL)  /**< 9-Reserved */
#define CLIF_TX_SYMBOL23_MOD_TX_S23_MILLER_ENABLE_POS                                                    (8UL)
#define CLIF_TX_SYMBOL23_MOD_TX_S23_MILLER_ENABLE_MASK                                                   (0x00000100UL)  /**< 8-If set to 1 pulse modulation is applied according to modified miller coding.*/
#define CLIF_TX_SYMBOL23_MOD_TX_S23_INV_ENV_POS                                                          (7UL)
#define CLIF_TX_SYMBOL23_MOD_TX_S23_INV_ENV_MASK                                                         (0x00000080UL)  /**< 7-If set to 1 the output envelope is inverted.*/
#define CLIF_TX_SYMBOL23_MOD_TX_S23_ENV_TYPE_POS                                                         (4UL)
#define CLIF_TX_SYMBOL23_MOD_TX_S23_ENV_TYPE_MASK                                                        (0x00000070UL)  /**< 4-Specifies the type of envelope used for transmission of data packets. The selected envelope type is applied to the pseudo bit stream. 000b Direct output 001b Manchester code 010b Manchster code with subcarrier 011b BPSK 100b RZ (pulse of half bit length at beginning of second half of bit) 101b RZ (pulse of half bit length at beginning of bit) 110b Manchester tupple 111b RFU*/
#define CLIF_TX_SYMBOL23_MOD_TX_S23_SC_FREQ_POS                                                          (3UL)
#define CLIF_TX_SYMBOL23_MOD_TX_S23_SC_FREQ_MASK                                                         (0x00000008UL)  /**< 3-Specifies the frequency of the subcarrier. 0 424 kHz 1 848 kHz*/
#define CLIF_TX_SYMBOL23_MOD_TX_S23_BIT_FREQ_POS                                                         (0UL)
#define CLIF_TX_SYMBOL23_MOD_TX_S23_BIT_FREQ_MASK                                                        (0x00000007UL)  /**< 0-Specifies the frequency of the bit-stream.  000b -> 1.695 MHz. 001b -> Reserved. 010b -> 26 kHz. 011b -> 53 kHz. 100b -> 106 kHz. 101b -> 212 kHz. 110b -> 424 kHz. 111b -> 848 kHz.*/

#define CLIF_TX_SYMBOL23_DEF                                                                              0xD
#define CLIF_TX_SYMBOL23_DEF_RESERVED_POS                                                                (24UL)
#define CLIF_TX_SYMBOL23_DEF_RESERVED_MASK                                                               (0xFF000000UL)  /**< 24-Reserved */
#define CLIF_TX_SYMBOL23_DEF_TX_SYMBOL3_DEF_POS                                                          (16UL)
#define CLIF_TX_SYMBOL23_DEF_TX_SYMBOL3_DEF_MASK                                                         (0x00FF0000UL)  /**< 16-Pattern definition for Symbol3 */
#define CLIF_TX_SYMBOL23_DEF_RESERVED1_POS                                                                (8UL)
#define CLIF_TX_SYMBOL23_DEF_RESERVED1_MASK                                                               (0x0000FF00UL)  /**< 8-Reserved */
#define CLIF_TX_SYMBOL23_DEF_TX_SYMBOL2_DEF_POS                                                          (0UL)
#define CLIF_TX_SYMBOL23_DEF_TX_SYMBOL2_DEF_MASK                                                         (0x000000FFUL)  /**< 0-Pattern definition for Symbol2*/

#define CLIF_TX_SYMBOL_CONFIG                                                                             0xE
#define CLIF_TX_SYMBOL_CONFIG_RESERVED_POS                                                               (31UL)
#define CLIF_TX_SYMBOL_CONFIG_RESERVED_MASK                                                              (0x80000000UL)  /**< 31-Reserved */
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL1_BURST_LEN_POS                                                   (27UL)
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL1_BURST_LEN_MASK                                                  (0x78000000UL)  /**< 27-Specifies the number of bits issued for symbol 1 burst. The 3 bits encode a range from 8 to 256 bit length: 0000b 8 bit 0001b 12 bit 0010b 16 bit 0011b 24 bit 0100b 32 bit 0101b 40 bit 0110b 48 bit 0111b 64 bit 1000b 80 bit 1001b 96 bit 1010b 112 bit 1011b 128 bit 1100b 160 bit 1101b 192 bit 1110b 224 bit 1111b 256 bit*/
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL1_BURST_TYPE_POS                                                  (26UL)
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL1_BURST_TYPE_MASK                                                 (0x04000000UL)  /**< 26-Specifies the type of the burst of Symbol1 (logical zero / logical one) */
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL1_BURST_ONLY_POS                                                  (25UL)
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL1_BURST_ONLY_MASK                                                 (0x02000000UL)  /**< 25-If set to 1. Symbol1 consists only of a burst and no symbol pattern */
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL1_BURST_ENABLE_POS                                                (24UL)
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL1_BURST_ENABLE_MASK                                               (0x01000000UL)  /**< 24-If set to 1. the burst of Symbol0 of the length defined in bit field SYMBOL1_BURST_LEN is enabled         */
#define CLIF_TX_SYMBOL_CONFIG_RESERVED1_POS                                                              (23UL)
#define CLIF_TX_SYMBOL_CONFIG_RESERVED1_MASK                                                             (0x00800000UL)  /**< 23-Reserved */
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL0_BURST_LEN_POS                                                   (19UL)
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL0_BURST_LEN_MASK                                                  (0x00780000UL)  /**< 19-Specifies the number of bits issued for symbol 0 burst. The 3 bits encode a range from 8 to 256 bit length: 0000b 8 bit 0001b 12 bit 0010b 16 bit 0011b 24 bit 0100b 32 bit 0101b 40 bit 0110b 48 bit 0111b 64 bit 1000b 80 bit 1001b 96 bit 1010b 112 bit 1011b 128 bit 1100b 160 bit 1101b 192 bit 1110b 224 bit 1111b 256 bit*/
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL0_BURST_TYPE_POS                                                  (18UL)
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL0_BURST_TYPE_MASK                                                 (0x00040000UL)  /**< 18-Specifies the type of the burst of Symbol0 (logical zero / logical one) */
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL0_BURST_ONLY_POS                                                  (17UL)
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL0_BURST_ONLY_MASK                                                 (0x00020000UL)  /**< 17-If set to 1. Symbol0 consists only of a burst and no symbol pattern */
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL0_BURST_ENABLE_POS                                                (16UL)
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL0_BURST_ENABLE_MASK                                               (0x00010000UL)  /**< 16-If set to 1. the burst of Symbol0 of the length defined in bit field SYMBOL0_BURST_LEN is enabled */
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL3_LEN_POS                                                         (13UL)
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL3_LEN_MASK                                                        (0x0000E000UL)  /**< 13-Specifies the number of valid bits of the symbol definition of Symbol3. The range is from 1 bit (value 0000) to 8 bit (value 111) */
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL2_LEN_POS                                                         (10UL)
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL2_LEN_MASK                                                        (0x00001C00UL)  /**< 10-Specifies the number of valid bits of the symbol definition of Symbol2. The range is from 1 bit (value 0000) to 8bit (value 111) */
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL1_LEN_POS                                                         (5UL)
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL1_LEN_MASK                                                        (0x000003E0UL)  /**< 5-Specifies the number of valid bits of the symbol definition of Symbol1. The range is from 1 bit (value 0000) to 31 bits (value 11110) */
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL0_LEN_POS                                                         (0UL)
#define CLIF_TX_SYMBOL_CONFIG_TX_SYMBOL0_LEN_MASK                                                        (0x0000001FUL)  /**< 0-Specifies the number of valid bits of the symbol definition of Symbol0. The range is from 1 bit (value 0000) to 31 bits (value 11110)*/

#define CLIF_TX_FRAME_CONFIG                                                                              0xF
#define CLIF_TX_FRAME_CONFIG_RESERVED_POS                                                                (19UL)
#define CLIF_TX_FRAME_CONFIG_RESERVED_MASK                                                               (0xFFF80000UL)  /**< 19-Reserved */
#define CLIF_TX_FRAME_CONFIG_TX_DATA_CODE_TYPE_POS                                                       (16UL)
#define CLIF_TX_FRAME_CONFIG_TX_DATA_CODE_TYPE_MASK                                                      (0x00070000UL)  /**< 16-Specifies the type of encoding of data to be used 000b No special code 001b 1 out of 4 code [I-Code SLI] 010b 1 out of 256 code [I-Code SLI] 011b Pulse interval encoding (PIE) [I-Code EPC-V2] 100b 2bit tuple code (intended only for test purpose) 101-111b Reserved */
#define CLIF_TX_FRAME_CONFIG_TX_STOPBIT_TYPE_POS                                                         (13UL)
#define CLIF_TX_FRAME_CONFIG_TX_STOPBIT_TYPE_MASK                                                        (0x0000E000UL)  /**< 13-Enables the stop bit (logic 1) and extra guard time (logic 1). The value 0 disables transmission of stop-bits. 000b no stop-bit. no EGT 001b stop-bit. no EGT 010b stop-bit + 1 EGT 011b stop-bit + 2 EGT 100b stop-bit + 3 EGT 101b stop-bit + 4 EGT 110b stop-bit + 5 EGT 111b stop-bit + 6 EGT */
#define CLIF_TX_FRAME_CONFIG_TX_STARTBIT_ENABLE_POS                                                      (12UL)
#define CLIF_TX_FRAME_CONFIG_TX_STARTBIT_ENABLE_MASK                                                     (0x00001000UL)  /**< 12-If set to 1. a start-bit (logic 0) will be send */
#define CLIF_TX_FRAME_CONFIG_TX_MSB_FIRST_POS                                                            (11UL)
#define CLIF_TX_FRAME_CONFIG_TX_MSB_FIRST_MASK                                                           (0x00000800UL)  /**< 11-If set to 1. data bytes are interpreted MSB first for data transmission */
#define CLIF_TX_FRAME_CONFIG_TX_PARITY_LAST_INV_ENABLE_POS                                               (10UL)
#define CLIF_TX_FRAME_CONFIG_TX_PARITY_LAST_INV_ENABLE_MASK                                              (0x00000400UL)  /**< 10-If set to 1. the parity bit of last sent data byte is inverted */
#define CLIF_TX_FRAME_CONFIG_TX_PARITY_TYPE_POS                                                          (9UL)
#define CLIF_TX_FRAME_CONFIG_TX_PARITY_TYPE_MASK                                                         (0x00000200UL)  /**< 9-Defines the type of the parity bit 0 Even Parity is calculated 1 Odd parity is calculated       */
#define CLIF_TX_FRAME_CONFIG_TX_PARITY_ENABLE_POS                                                        (8UL)
#define CLIF_TX_FRAME_CONFIG_TX_PARITY_ENABLE_MASK                                                       (0x00000100UL)  /**< 8-If set to 1. a parity bit is calculated and appended to each byte transmitted. If the Transmission Of Data Is Enabled and TX_NUM_BYTES_2_SEND is zero. then a NO_DATA_ERROR occurs. */
#define CLIF_TX_FRAME_CONFIG_RESERVED1_POS                                                               (5UL)
#define CLIF_TX_FRAME_CONFIG_RESERVED1_MASK                                                              (0x000000E0UL)  /**< 5-Reserved */
#define CLIF_TX_FRAME_CONFIG_TX_DATA_ENABLE_POS                                                          (4UL)
#define CLIF_TX_FRAME_CONFIG_TX_DATA_ENABLE_MASK                                                         (0x00000010UL)  /**< 4-If set to 1. transmission of data is enabled otherwise only symbols are tranmitted. */
#define CLIF_TX_FRAME_CONFIG_TX_STOP_SYMBOL_POS                                                          (2UL)
#define CLIF_TX_FRAME_CONFIG_TX_STOP_SYMBOL_MASK                                                         (0x0000000CUL)  /**< 2-Defines which pattern symbol is sent as frame stop-symbol 00b No symbol is sent 01b Symbol1 is sent 10b Symbol2 is sent 11b Symbol3 is sent */
#define CLIF_TX_FRAME_CONFIG_TX_START_SYMBOL_POS                                                         (0UL)
#define CLIF_TX_FRAME_CONFIG_TX_START_SYMBOL_MASK                                                        (0x00000003UL)  /**< 0-Defines which symbol pattern is sent as frame start-symbol 00b No symbol pattern is sent 01b Symbol0 is sent 10b Symbol1 is sent 11b Symbol2 is sent*/

#define CLIF_TX_DATA_MOD                                                                                  0x10
#define CLIF_TX_DATA_MOD_RESERVED_POS                                                                    (25UL)
#define CLIF_TX_DATA_MOD_RESERVED_MASK                                                                   (0xFE000000UL)  /**< 25-Reserved*/
#define CLIF_TX_DATA_MOD_TX_ICODE_DATA_MODWIDTH_ENABLE_POS                                               (24UL)
#define CLIF_TX_DATA_MOD_TX_ICODE_DATA_MODWIDTH_ENABLE_MASK                                              (0x01000000UL)  /**< 24-Enables modulation width of icode data. Width of modulation is defined by the TX_DATA_MODWIDTH field. When 1, we should have TX_DATA_ENV_TYPE=0 and TX_DATA_INV_ENV=0*/
#define CLIF_TX_DATA_MOD_TX_DATA_MODWIDTH_POS                                                            (16UL)
#define CLIF_TX_DATA_MOD_TX_DATA_MODWIDTH_MASK                                                           (0x00FF0000UL)  /**< 16-Specifies the length of a pulse for sending data with miller pulse modulation enabled. The length is given by the number of carrier clocks + 1.*/
#define CLIF_TX_DATA_MOD_RESERVED1_POS                                                                   (9UL)
#define CLIF_TX_DATA_MOD_RESERVED1_MASK                                                                  (0x0000FE00UL)  /**< 9-Reserved*/
#define CLIF_TX_DATA_MOD_TX_DATA_MILLER_ENABLE_POS                                                       (8UL)
#define CLIF_TX_DATA_MOD_TX_DATA_MILLER_ENABLE_MASK                                                      (0x00000100UL)  /**< 8-If set to 1 pulse modulation is applied according to modified miller coding*/
#define CLIF_TX_DATA_MOD_TX_DATA_INV_ENV_POS                                                             (7UL)
#define CLIF_TX_DATA_MOD_TX_DATA_INV_ENV_MASK                                                            (0x00000080UL)  /**< 7-If set to 1 the output envelope is inverted*/
#define CLIF_TX_DATA_MOD_TX_DATA_ENV_TYPE_POS                                                            (4UL)
#define CLIF_TX_DATA_MOD_TX_DATA_ENV_TYPE_MASK                                                           (0x00000070UL)  /**< 4-Specifies the type of envelope used for transmission of data packets. The selected envelope type is applied to the pseudo bit stream. 000b Direct output 001b Manchester code 010b Manchster code with subcarrier 011b BPSK 100b RZ (pulse of half bit length at beginning of second half of bit) 101b RZ (pulse of half bit length at beginning of bit) 110b Manchester tupple coding 111b RFU*/
#define CLIF_TX_DATA_MOD_TX_DATA_SC_FREQ_POS                                                             (3UL)
#define CLIF_TX_DATA_MOD_TX_DATA_SC_FREQ_MASK                                                            (0x00000008UL)  /**< 3-Specifies the frequency of the subcarrier. 0 424 kHz 1 848 kHz*/
#define CLIF_TX_DATA_MOD_TX_DATA_BIT_FREQ_POS                                                            (0UL)
#define CLIF_TX_DATA_MOD_TX_DATA_BIT_FREQ_MASK                                                           (0x00000007UL)  /**< 0-Specifies the frequency of the bit-stream.  000b -> 1.695 MHz. 001b -> Reserved. 010b -> 26 kHz. 011b -> 53 kHz. 100b -> 106 kHz. 101b -> 212 kHz. 110b -> 424 kHz. 111b -> 848 kHz.*/

#define CLIF_TX_WAIT                                                                                      0x11
#define CLIF_TX_WAIT_RESERVED_POS                                                                        (28UL)
#define CLIF_TX_WAIT_RESERVED_MASK                                                                       (0xF0000000UL)  /**< 28-Reserved */
#define CLIF_TX_WAIT_TX_WAIT_VALUE_POS                                                                   (8UL)
#define CLIF_TX_WAIT_TX_WAIT_VALUE_MASK                                                                  (0x0FFFFF00UL)  /**< 8-Defines the tx_wait timer reload value. Note: If set to 00000h the tx_wait guard time is disabled Note: This bit is set by HW a protocol is detected in automatic mode detection*/
#define CLIF_TX_WAIT_TX_WAIT_PRESCALER_POS                                                               (0UL)
#define CLIF_TX_WAIT_TX_WAIT_PRESCALER_MASK                                                              (0x000000FFUL)  /**< 0-Defines the prescaler reload value for the tx_wait timer. Note: This bit is set by HW a protocol is  detected in automatic mode detection*/

