QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5190_Reg.h
#define CLIF_CRC_TX_CONFIG                                                                                0x12
#define CLIF_CRC_TX_CONFIG_TX_CRC_PRESET_VALUE_POS                                                       (16UL)
#define CLIF_CRC_TX_CONFIG_TX_CRC_PRESET_VALUE_MASK                                                      (0xFFFF0000UL)  /**< 16-Arbitrary preset value for the Tx-Encoder CRC calculation. */
#define CLIF_CRC_TX_CONFIG_RESERVED_POS                                                                  (7UL)
#define CLIF_CRC_TX_CONFIG_RESERVED_MASK                                                                 (0x0000FF80UL)  /**< 7-Reserved */
#define CLIF_CRC_TX_CONFIG_TX_CRC_BYTE2_ENABLE_POS                                                       (6UL)
#define CLIF_CRC_TX_CONFIG_TX_CRC_BYTE2_ENABLE_MASK                                                      (0x00000040UL)  /**< 6-If set. the CRC is calculated from the 2nd byte onwards (intended for HID). Note that this option is used in the Tx-Encoder.           */
#define CLIF_CRC_TX_CONFIG_TX_CRC_PRESET_SEL_POS                                                         (3UL)
#define CLIF_CRC_TX_CONFIG_TX_CRC_PRESET_SEL_MASK                                                        (0x00000038UL)  /**< 3-Preset value of the CRC register for the Tx-Encoder. For a CRC calculation using 5bits. only the LSByte is used. 000b* 0000h. reset value 001b  6363h 010b A671h 011b  FFFFh 100b 0012h 101b E012h 110b RFU 111b Use arbitrary preset value TX_CRC_PRESET_VALUE*/
#define CLIF_CRC_TX_CONFIG_TX_CRC_TYPE_POS                                                               (2UL)
#define CLIF_CRC_TX_CONFIG_TX_CRC_TYPE_MASK                                                              (0x00000004UL)  /**< 2-Controls the type of CRC calulation for the Tx-Encoder 0* 16bit CRC calculation. reset value 1 5bit CRC calculation */
#define CLIF_CRC_TX_CONFIG_TX_CRC_INV_POS                                                                (1UL)
#define CLIF_CRC_TX_CONFIG_TX_CRC_INV_MASK                                                               (0x00000002UL)  /**< 1-Controls the sending of an inverted CRC value by the Tx-Encoder 0* Not inverted CRC checksum. reset value 1 Inverted CRC checksum */
#define CLIF_CRC_TX_CONFIG_TX_CRC_ENABLE_POS                                                             (0UL)
#define CLIF_CRC_TX_CONFIG_TX_CRC_ENABLE_MASK                                                            (0x00000001UL)  /**< 0-If set to one. the Tx-Encoder will compute and transmit a CRC.*/

#define CLIF_TX_UNDERSHOOT_CONFIG                                                                         0x13
#define CLIF_TX_UNDERSHOOT_CONFIG_RESERVED_POS                                                           (0UL)
#define CLIF_TX_UNDERSHOOT_CONFIG_RESERVED_MASK                                                          (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_TX_OVERSHOOT_CONFIG                                                                          0x14
#define CLIF_TX_OVERSHOOT_CONFIG_RESERVED_POS                                                            (0UL)
#define CLIF_TX_OVERSHOOT_CONFIG_RESERVED_MASK                                                           (0xFFFFFFFFUL)  /**< 0-Reserved */

#define CLIF_SS_TX_CFG                                                                                    0x15
#define CLIF_SS_TX_CFG_RESERVED_POS                                                                      (14UL)
#define CLIF_SS_TX_CFG_RESERVED_MASK                                                                     (0xFFFFC000UL)  /**< 14-Reserved*/
#define CLIF_SS_TX_CFG_TX2_USE_TX1_CONF_POS                                                              (13UL)
#define CLIF_SS_TX_CFG_TX2_USE_TX1_CONF_MASK                                                             (0x00002000UL)  /**< 13-When 1, the tx1 configuration is used also for tx2: all CLIF_SS_TX2_* registers are discarded and configurations from corresponding CLIF_SS_TX1 register is used.*/
#define CLIF_SS_TX_CFG_RESERVED1_POS                                                                     (6UL)
#define CLIF_SS_TX_CFG_RESERVED1_MASK                                                                    (0x00001FC0UL)  /**< 6-Reserved*/
#define CLIF_SS_TX_CFG_TX2_CLK_MODE_DEFAULT_POS                                                          (3UL)
#define CLIF_SS_TX_CFG_TX2_CLK_MODE_DEFAULT_MASK                                                         (0x00000038UL)  /**< 3-TX2 clk mode without field (RM and CM)*/
#define CLIF_SS_TX_CFG_TX1_CLK_MODE_DEFAULT_POS                                                          (0UL)
#define CLIF_SS_TX_CFG_TX1_CLK_MODE_DEFAULT_MASK                                                         (0x00000007UL)  /**< 0-TX1 clk mode without field (RM and CM)*/

#define CLIF_SS_TX1_RMCFG                                                                                 0x16
#define CLIF_SS_TX1_RMCFG_RESERVED_POS                                                                   (25UL)
#define CLIF_SS_TX1_RMCFG_RESERVED_MASK                                                                  (0xFE000000UL)  /**< 25-Reserved*/
#define CLIF_SS_TX1_RMCFG_TX1_CLK_MODE_TRANS_RM_POS                                                      (22UL)
#define CLIF_SS_TX1_RMCFG_TX1_CLK_MODE_TRANS_RM_MASK                                                     (0x01C00000UL)  /**< 22-TX1 clock mode in RM during transition*/
#define CLIF_SS_TX1_RMCFG_TX1_CLK_MODE_MOD_RM_POS                                                        (19UL)
#define CLIF_SS_TX1_RMCFG_TX1_CLK_MODE_MOD_RM_MASK                                                       (0x00380000UL)  /**< 19-TX1 clock mode of modulated wave in RM*/
#define CLIF_SS_TX1_RMCFG_TX1_CLK_MODE_CW_RM_POS                                                         (16UL)
#define CLIF_SS_TX1_RMCFG_TX1_CLK_MODE_CW_RM_MASK                                                        (0x00070000UL)  /**< 16-TX1 clock mode of unmodulated wave in RM*/
#define CLIF_SS_TX1_RMCFG_TX1_AMP_MOD_RM_POS                                                             (8UL)
#define CLIF_SS_TX1_RMCFG_TX1_AMP_MOD_RM_MASK                                                            (0x0000FF00UL)  /**< 8-TX1 amplitude of modulated wave in RM*/
#define CLIF_SS_TX1_RMCFG_TX1_AMP_CW_RM_POS                                                              (0UL)
#define CLIF_SS_TX1_RMCFG_TX1_AMP_CW_RM_MASK                                                             (0x000000FFUL)  /**< 0-TX1 amplitude of unmodulated wave in RM*/

#define CLIF_SS_TX2_RMCFG                                                                                 0x17
#define CLIF_SS_TX2_RMCFG_RESERVED_POS                                                                   (25UL)
#define CLIF_SS_TX2_RMCFG_RESERVED_MASK                                                                  (0xFE000000UL)  /**< 25-Reserved*/
#define CLIF_SS_TX2_RMCFG_TX2_CLK_MODE_TRANS_RM_POS                                                      (22UL)
#define CLIF_SS_TX2_RMCFG_TX2_CLK_MODE_TRANS_RM_MASK                                                     (0x01C00000UL)  /**< 22-TX2 clock mode in RM during transition*/
#define CLIF_SS_TX2_RMCFG_TX2_CLK_MODE_MOD_RM_POS                                                        (19UL)
#define CLIF_SS_TX2_RMCFG_TX2_CLK_MODE_MOD_RM_MASK                                                       (0x00380000UL)  /**< 19-TX2 clock mode of modulated wave in RM*/
#define CLIF_SS_TX2_RMCFG_TX2_CLK_MODE_CW_RM_POS                                                         (16UL)
#define CLIF_SS_TX2_RMCFG_TX2_CLK_MODE_CW_RM_MASK                                                        (0x00070000UL)  /**< 16-TX2 clock mode of unmodulated wave in RM*/
#define CLIF_SS_TX2_RMCFG_TX2_AMP_MOD_RM_POS                                                             (8UL)
#define CLIF_SS_TX2_RMCFG_TX2_AMP_MOD_RM_MASK                                                            (0x0000FF00UL)  /**< 8-TX2 amplitude of modulated wave in RM*/
#define CLIF_SS_TX2_RMCFG_TX2_AMP_CW_RM_POS                                                              (0UL)
#define CLIF_SS_TX2_RMCFG_TX2_AMP_CW_RM_MASK                                                             (0x000000FFUL)  /**< 0-TX2 amplitude of unmodulated wave in RM*/

#define CLIF_SS_TX_TRANS_CFG                                                                              0x19
#define CLIF_SS_TX_TRANS_CFG_RESERVED_POS                                                                (12UL)
#define CLIF_SS_TX_TRANS_CFG_RESERVED_MASK                                                               (0xFFFFF000UL)  /**< 12-Reserved*/
#define CLIF_SS_TX_TRANS_CFG_TX2_SS_TRANS_RATE_POS                                                       (11UL)
#define CLIF_SS_TX_TRANS_CFG_TX2_SS_TRANS_RATE_MASK                                                      (0x00000800UL)  /**< 11-TX2 shaping edge rate: 0: 1/fc, 1: 2/fc. 1/fc should be selected for CM.*/
#define CLIF_SS_TX_TRANS_CFG_TX1_SS_TRANS_RATE_POS                                                       (10UL)
#define CLIF_SS_TX_TRANS_CFG_TX1_SS_TRANS_RATE_MASK                                                      (0x00000400UL)  /**< 10-TX2 shaping edge rate: 0: 1/fc, 1: 2/fc. 1/fc should be selected for CM*/
#define CLIF_SS_TX_TRANS_CFG_TX2_SS_TRANS_LENGTH_POS                                                     (5UL)
#define CLIF_SS_TX_TRANS_CFG_TX2_SS_TRANS_LENGTH_MASK                                                    (0x000003E0UL)  /**< 5-TX2 shaping edge length: from 0 (disable) to 16. for CM, only 0 or 4 values are valid*/
#define CLIF_SS_TX_TRANS_CFG_TX1_SS_TRANS_LENGTH_POS                                                     (0UL)
#define CLIF_SS_TX_TRANS_CFG_TX1_SS_TRANS_LENGTH_MASK                                                    (0x0000001FUL)  /**< 0-TX1 shaping edge length: from 0 (disable) to 16. for CM, only 0 or 4 values are valid*/

#define CLIF_SIGPRO_CONFIG                                                                                0x1D
#define CLIF_SIGPRO_CONFIG_RESERVED_POS                                                                  (0UL)
#define CLIF_SIGPRO_CONFIG_RESERVED_MASK                                                                 (0xFFFFFFFFUL)  /**< 0-RFU*/

#define CLIF_SIGPRO_RM_CONFIG                                                                             0x1F
#define CLIF_SIGPRO_RM_CONFIG_RESERVED_POS                                                               (0UL)
#define CLIF_SIGPRO_RM_CONFIG_RESERVED_MASK                                                              (0xFFFFFFFFUL)  /**< 0-RFU*/

#define CLIF_SIGPRO_RM_PATTERN                                                                            0x20
#define CLIF_SIGPRO_RM_PATTERN_RM_SYNC_PATTERN_POS                                                       (16UL)
#define CLIF_SIGPRO_RM_PATTERN_RM_SYNC_PATTERN_MASK                                                      (0xFFFF0000UL)  /**< 16-Sync pattern for Felica. LSB transmitted last*/
#define CLIF_SIGPRO_RM_PATTERN_RM_SYNC_PATTERN_EXT4_POS                                                  (15UL)
#define CLIF_SIGPRO_RM_PATTERN_RM_SYNC_PATTERN_EXT4_MASK                                                 (0x00008000UL)  /**< 15-extend Felica sync pattern with 16 leading 0s*/
#define CLIF_SIGPRO_RM_PATTERN_RM_SYNC_PATTERN_EXT2_POS                                                  (14UL)
#define CLIF_SIGPRO_RM_PATTERN_RM_SYNC_PATTERN_EXT2_MASK                                                 (0x00004000UL)  /**< 14-extend Felica sync pattern with 8 leading 0s*/
#define CLIF_SIGPRO_RM_PATTERN_RM_RECEIVE_TILL_END_POS                                                   (13UL)
#define CLIF_SIGPRO_RM_PATTERN_RM_RECEIVE_TILL_END_MASK                                                  (0x00002000UL)  /**< 13-do not stop the reception before RxDecoder sends a stop command*/
#define CLIF_SIGPRO_RM_PATTERN_RESERVED_POS                                                              (12UL)
#define CLIF_SIGPRO_RM_PATTERN_RESERVED_MASK                                                             (0x00001000UL)  /**< 12-Reserved*/
#define CLIF_SIGPRO_RM_PATTERN_RM_SOF_PATTERN_POS                                                        (0UL)
#define CLIF_SIGPRO_RM_PATTERN_RM_SOF_PATTERN_MASK                                                       (0x00000FFFUL)  /**< 0-SOF pattern for Type B. LSB transmitted last or Start Byte pattern for NFC passive.*/

#define CLIF_SIGPRO_RM_ENABLES                                                                            0x21
#define CLIF_SIGPRO_RM_ENABLES_RESERVED_POS                                                              (2UL)
#define CLIF_SIGPRO_RM_ENABLES_RESERVED_MASK                                                             (0xFFFFFFFCUL)  /**< 2-Reserved*/
#define CLIF_SIGPRO_RM_ENABLES_RM_RESYNC_RESET_ENABLE_POS                                                (1UL)
#define CLIF_SIGPRO_RM_ENABLES_RM_RESYNC_RESET_ENABLE_MASK                                               (0x00000002UL)  /**< 1-Enables receiver reset due to re-sync*/
#define CLIF_SIGPRO_RM_ENABLES_RESERVED1_POS                                                             (0UL)
#define CLIF_SIGPRO_RM_ENABLES_RESERVED1_MASK                                                            (0x00000001UL)  /**< 0-Reserved*/

