QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5190_Reg.h
#define CLIF_SIGPRO_RM_TECH                                                                               0x22
#define CLIF_SIGPRO_RM_TECH_RESERVED_POS                                                                 (17UL)
#define CLIF_SIGPRO_RM_TECH_RESERVED_MASK                                                                (0xFFFE0000UL)  /**< 17-Reserved*/
#define CLIF_SIGPRO_RM_TECH_RM_MF_GAIN_POS                                                               (15UL)
#define CLIF_SIGPRO_RM_TECH_RM_MF_GAIN_MASK                                                              (0x00018000UL)  /**< 15-Defines the gain of the Matched-Filters*/
#define CLIF_SIGPRO_RM_TECH_RESERVED1_POS                                                                (0UL)
#define CLIF_SIGPRO_RM_TECH_RESERVED1_MASK                                                               (0x00007FFFUL)  /**< 0-Reserved*/

#define CLIF_SIGPRO_NOISE_CONFIG1                                                                         0x23
#define CLIF_SIGPRO_NOISE_CONFIG1_RESERVED_POS                                                           (0UL)
#define CLIF_SIGPRO_NOISE_CONFIG1_RESERVED_MASK                                                          (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_SIGPRO_NOISE_CONFIG2                                                                         0x24
#define CLIF_SIGPRO_NOISE_CONFIG2_RESERVED_POS                                                           (0UL)
#define CLIF_SIGPRO_NOISE_CONFIG2_RESERVED_MASK                                                          (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_RX_PROTOCOL_CONFIG                                                                           0x25
#define CLIF_RX_PROTOCOL_CONFIG_RESERVED_POS                                                             (6UL)
#define CLIF_RX_PROTOCOL_CONFIG_RESERVED_MASK                                                            (0xFFFFFFC0UL)  /**< 6-Reserved*/
#define CLIF_RX_PROTOCOL_CONFIG_RX_BIT_ALIGN_POS                                                         (3UL)
#define CLIF_RX_PROTOCOL_CONFIG_RX_BIT_ALIGN_MASK                                                        (0x00000038UL)  /**< 3-Defines the position of the 1st received data bit in the formed data byte.000b - 0 position...111b - 7th position*/
#define CLIF_RX_PROTOCOL_CONFIG_RX_PARITY_TYPE_POS                                                       (2UL)
#define CLIF_RX_PROTOCOL_CONFIG_RX_PARITY_TYPE_MASK                                                      (0x00000004UL)  /**< 2-0 - data + parity bits contain even number of 1. 1 - data + parity bits contain odd number of 1. Valid if cfg_rx_parity_enable_i ==1.*/
#define CLIF_RX_PROTOCOL_CONFIG_RX_PARITY_ENABLE_POS                                                     (1UL)
#define CLIF_RX_PROTOCOL_CONFIG_RX_PARITY_ENABLE_MASK                                                    (0x00000002UL)  /**< 1-If set to 1, the bit following last data bit in the frame character is considered as parity bit.*/
#define CLIF_RX_PROTOCOL_CONFIG_RESERVED1_POS                                                            (0UL)
#define CLIF_RX_PROTOCOL_CONFIG_RESERVED1_MASK                                                           (0x00000001UL)  /**< 0-Reserved.*/

#define CLIF_RX_FRAME_LENGTH                                                                              0x26
#define CLIF_RX_FRAME_LENGTH_RESERVED_POS                                                                (31UL)
#define CLIF_RX_FRAME_LENGTH_RESERVED_MASK                                                               (0x80000000UL)  /**< 31-Reserved*/
#define CLIF_RX_FRAME_LENGTH_RX_FRAME_MAXLEN_POS                                                         (16UL)
#define CLIF_RX_FRAME_LENGTH_RX_FRAME_MAXLEN_MASK                                                        (0x7FFF0000UL)  /**< 16-Maximal number of received [DATA + CRC] bits in theframe. The violation of the maximum length limit can be also configured as an Error/EMD condition. If the max length violation is configured as error - the frame reception is stopped in case of maximum length limit exceeding. Otherwise the reception is continued.0x0000 - 1 bit...0x7FFF - 32K bits*/
#define CLIF_RX_FRAME_LENGTH_RESERVED1_POS                                                               (15UL)
#define CLIF_RX_FRAME_LENGTH_RESERVED1_MASK                                                              (0x00008000UL)  /**< 15-Reserved*/
#define CLIF_RX_FRAME_LENGTH_RX_FRAME_MINLEN_POS                                                         (0UL)
#define CLIF_RX_FRAME_LENGTH_RX_FRAME_MINLEN_MASK                                                        (0x00007FFFUL)  /**< 0-Minimal number of received [DATA + CRC] bits in the frame. The violation of the minimum length limit can be also configured as an Error/EMD condition.The parameter also defines the number of received[DATA + CRC] bits before which any of the EOF pattern or INVPAR stop condition events are ignored.0x0000 - 1 bit...0x7FFF - 32K bits*/

#define CLIF_RX_ERROR_CONFIG                                                                              0x27
#define CLIF_RX_ERROR_CONFIG_RESERVED_POS                                                                (0UL)
#define CLIF_RX_ERROR_CONFIG_RESERVED_MASK                                                               (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_RXCTRL_STATUS                                                                                0x28
#define CLIF_RXCTRL_STATUS_RXCTRL_RESERVED_POS                                                           (9UL)
#define CLIF_RXCTRL_STATUS_RXCTRL_RESERVED_MASK                                                          (0xFFFFFE00UL)  /**< 9-Reserved*/
#define CLIF_RXCTRL_STATUS_RXCTRL_HF_ATT_VAL_POS                                                         (3UL)
#define CLIF_RXCTRL_STATUS_RXCTRL_HF_ATT_VAL_MASK                                                        (0x000001F8UL)  /**< 3-8 HF attenuator value*/
#define CLIF_RXCTRL_STATUS_RXCTRL_RESERVED1_POS                                                          (0UL)
#define CLIF_RXCTRL_STATUS_RXCTRL_RESERVED1_MASK                                                         (0x00000007UL)  /**< 0-Reserved*/

#define CLIF_SIGPRO_IIR_CONFIG1                                                                           0x29
#define CLIF_SIGPRO_IIR_CONFIG1_RESERVED_POS                                                             (0UL)
#define CLIF_SIGPRO_IIR_CONFIG1_RESERVED_MASK                                                            (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_SIGPRO_IIR_CONFIG0                                                                           0x2A
#define CLIF_SIGPRO_IIR_CONFIG0_RESERVED_POS                                                             (1UL)
#define CLIF_SIGPRO_IIR_CONFIG0_RESERVED_MASK                                                            (0xFFFFFFFEUL)  /**< 0-Reserved*/
#define CLIF_SIGPRO_IIR_CONFIG0_IIR_ENABLE_POS                                                           (0UL)
#define CLIF_SIGPRO_IIR_CONFIG0_IIR_ENABLE_MASK                                                          (0x00000001UL)  /**< 0-Enable the IIR filter*/

#define CLIF_DGRM_DAC_FILTER                                                                              0x2B
#define CLIF_DGRM_DAC_FILTER_RESERVED_POS                                                                (0UL)
#define CLIF_DGRM_DAC_FILTER_RESERVED_MASK                                                               (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_DGRM_CONFIG                                                                                  0x2C
#define CLIF_DGRM_CONFIG_RESERVED_POS                                                                    (0UL)
#define CLIF_DGRM_CONFIG_RESERVED_MASK                                                                   (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_DGRM_BBA                                                                                     0x2D
#define CLIF_DGRM_BBA_RESERVED_POS                                                                       (17UL)
#define CLIF_DGRM_BBA_RESERVED_MASK                                                                      (0xFFFE0000UL)  /**< 17-31 Reserved*/
#define CLIF_DGRM_BBA_DGRM_BBA_MIN_VAL_POS                                                               (14UL)
#define CLIF_DGRM_BBA_DGRM_BBA_MIN_VAL_MASK                                                              (0x0001C000UL)  /**< 14-16 Defines the minimum value of BBA gain. */
#define CLIF_DGRM_BBA_DGRM_BBA_MAX_VAL_POS                                                               (11UL)
#define CLIF_DGRM_BBA_DGRM_BBA_MAX_VAL_MASK                                                              (0x00003800UL)  /**< 11-13 Defines the maximum value of BBA gain.*/
#define CLIF_DGRM_BBA_DGRM_BBA_INIT_VAL_POS                                                              (8UL)
#define CLIF_DGRM_BBA_DGRM_BBA_INIT_VAL_MASK                                                             (0x00000700UL)  /**< 8-10 Defines initial value of BBA gain. If BBA fast and slow modes are disabled, this value defines the forced value.*/
#define CLIF_DGRM_BBA_RESERVED1_POS                                                                      (0UL)
#define CLIF_DGRM_BBA_RESERVED1_MASK                                                                     (0x000000FFUL)  /**< 0-7 Reserved */

