QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5190_Reg.h
#define CLIF_DGRM_DCO                                                                                     0x2E
#define CLIF_DGRM_DCO_RESERVED_POS                                                                       (0UL)
#define CLIF_DGRM_DCO_RESERVED_MASK                                                                      (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_DGRM_HF_ATT                                                                                  0x2F
#define CLIF_DGRM_HF_ATT_RESERVED_POS                                                                    (0UL)
#define CLIF_DGRM_HF_ATT_RESERVED_MASK                                                                   (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_DGRM_RSSI                                                                                    0x30
#define CLIF_DGRM_RSSI_RESERVED_POS                                                                      (30UL)
#define CLIF_DGRM_RSSI_RESERVED_MASK                                                                     (0xC0000000UL)  /**< 30-Reserved*/
#define CLIF_DGRM_RSSI_DGRM_SIGNAL_DETECT_TH_OVR_POS                                                     (29UL)
#define CLIF_DGRM_RSSI_DGRM_SIGNAL_DETECT_TH_OVR_MASK                                                    (0x20000000UL)  /**< 29-Enables the override of signal detect threshold. Override value is set based on DGRM_SIGNAL_DETECT_TH_OVR_VAL.*/
#define CLIF_DGRM_RSSI_RESERVED1_POS                                                                     (23UL)
#define CLIF_DGRM_RSSI_RESERVED1_MASK                                                                    (0x1F800000UL)  /**< 23-28 Reserved*/
#define CLIF_DGRM_RSSI_DGRM_RSSI_HYST_POS                                                                (17UL)
#define CLIF_DGRM_RSSI_DGRM_RSSI_HYST_MASK                                                               (0x007E0000UL)  /**< 17-Hysteresis value for RSSI target*/
#define CLIF_DGRM_RSSI_DGRM_RSSI_TARGET_POS                                                              (7UL)
#define CLIF_DGRM_RSSI_DGRM_RSSI_TARGET_MASK                                                             (0x0001FF80UL)  /**< 7-RSSI target value*/
#define CLIF_DGRM_RSSI_DGRM_SIGNAL_DETECT_TH_OVR_VAL_POS                                                 (0UL)
#define CLIF_DGRM_RSSI_DGRM_SIGNAL_DETECT_TH_OVR_VAL_MASK                                                (0x0000007FUL)  /**< 0-Defines the override value for signal detect threshold when DGRM_SIGNAL_DETECT_TH_OVR is set.*/

#define CLIF_CRC_RX_CONFIG                                                                                0x31
#define CLIF_CRC_RX_CONFIG_RX_CRC_PRESET_VALUE_POS                                                       (16UL)
#define CLIF_CRC_RX_CONFIG_RX_CRC_PRESET_VALUE_MASK                                                      (0xFFFF0000UL)  /**< 16-Arbitrary preset value for the Rx-Decoder CRC calculation. */
#define CLIF_CRC_RX_CONFIG_RESERVED_POS                                                                  (8UL)
#define CLIF_CRC_RX_CONFIG_RESERVED_MASK                                                                 (0x0000FF00UL)  /**< 8-Reserved */
#define CLIF_CRC_RX_CONFIG_RX_FORCE_CRC_WRITE_POS                                                        (7UL)
#define CLIF_CRC_RX_CONFIG_RX_FORCE_CRC_WRITE_MASK                                                       (0x00000080UL)  /**< 7-If set. the Rx-Decoder will send to the RAM the CRC bits as well.*/
#define CLIF_CRC_RX_CONFIG_RX_CRC_ALLOW_BITS_POS                                                         (6UL)
#define CLIF_CRC_RX_CONFIG_RX_CRC_ALLOW_BITS_MASK                                                        (0x00000040UL)  /**< 6-If activated the frame with length =< CRC_length will be always sent to the System RAM as is, without CRC bits removal.*/
#define CLIF_CRC_RX_CONFIG_RX_CRC_PRESET_SEL_POS                                                         (3UL)
#define CLIF_CRC_RX_CONFIG_RX_CRC_PRESET_SEL_MASK                                                        (0x00000038UL)  /**< 3-Preset value of the CRC register for the Rx-Decoder. For a CRC calculation using 5bits only the LSByte is used. 000b* 0000h reset value Note that this configuration is set by the Mode detector for FeliCa. 001b  6363h Note that this configuration is set by the Mode detector for ISO14443 type A. 010b  A671h 011b FFFFh Note that this configuration is set by the Mode detector for ISO14443 type B. 100b 0012h 101b E012h 110b RFU 111b Use arbitrary preset value RX_CRC_PRESET_VALUE*/
#define CLIF_CRC_RX_CONFIG_RX_CRC_TYPE_POS                                                               (2UL)
#define CLIF_CRC_RX_CONFIG_RX_CRC_TYPE_MASK                                                              (0x00000004UL)  /**< 2-Controls the type of CRC calulation for the Rx-Decoder 0* 16bit CRC calculation. reset value 1 5bit CRC calculation */
#define CLIF_CRC_RX_CONFIG_RX_CRC_INV_POS                                                                (1UL)
#define CLIF_CRC_RX_CONFIG_RX_CRC_INV_MASK                                                               (0x00000002UL)  /**< 1-Controls the comparison of the CRC checksum for the Rx-Decoder 0* Not inverted CRC value: 0000h reset value Note that this nit is cleared by the Mode detector for ISO14443 type A and FeliCa. 1 Inverted CRC value: F0B8h Note that this bit is set by the Mode detector for ISO14443 type B.*/
#define CLIF_CRC_RX_CONFIG_RX_CRC_ENABLE_POS                                                             (0UL)
#define CLIF_CRC_RX_CONFIG_RX_CRC_ENABLE_MASK                                                            (0x00000001UL)  /**< 0-If set. the Rx-Decoder will check the CRC for correctness. Note that this bit is set by the Mode Detector. when ISO14443 type B. or FeliCa (212 or 424kBd) is detected.*/

#define CLIF_RX_WAIT                                                                                      0x32
#define CLIF_RX_WAIT_RESERVED_POS                                                                        (28UL)
#define CLIF_RX_WAIT_RESERVED_MASK                                                                       (0xF0000000UL)  /**< 28-Reserved */
#define CLIF_RX_WAIT_RX_WAIT_VALUE_POS                                                                   (8UL)
#define CLIF_RX_WAIT_RX_WAIT_VALUE_MASK                                                                  (0x0FFFFF00UL)  /**< 8-Defines the rx_wait timer reload value. Note: If set to 00000h the rx_wait guard time is disabled */
#define CLIF_RX_WAIT_RX_WAIT_PRESCALER_POS                                                               (0UL)
#define CLIF_RX_WAIT_RX_WAIT_PRESCALER_MASK                                                              (0x000000FFUL)  /**< 0-Defines the prescaler reload value for the rx_wait timer.*/

