QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5190_Reg.h
#define CLIF_DCOC_CONFIG                                                                                  0x33
#define CLIF_DCOC_CONFIG_RESERVED_POS                                                                    (0UL)
#define CLIF_DCOC_CONFIG_RESERVED_MASK                                                                   (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_RXM_CTRL                                                                                     0x35
#define CLIF_RXM_CTRL_RESERVED_POS                                                                       (0UL)
#define CLIF_RXM_CTRL_RESERVED_MASK                                                                      (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_ANA_AGC_DCO_CTRL                                                                             0x36
#define CLIF_ANA_AGC_DCO_CTRL_RESERVED_POS                                                               (0UL)
#define CLIF_ANA_AGC_DCO_CTRL_RESERVED_MASK                                                              (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_SIGPRO_CM_CONFIG                                                                             0x37
#define CLIF_SIGPRO_CM_CONFIG_RESERVED_POS                                                               (0UL)
#define CLIF_SIGPRO_CM_CONFIG_RESERVED_MASK                                                              (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_GCM_CONFIG2                                                                                  0x38
#define CLIF_GCM_CONFIG2_RESERVED_POS                                                                    (0UL)
#define CLIF_GCM_CONFIG2_RESERVED_MASK                                                                   (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_GCM_CONFIG1                                                                                  0x39
#define CLIF_GCM_CONFIG1_RESERVED_POS                                                                    (0UL)
#define CLIF_GCM_CONFIG1_RESERVED_MASK                                                                   (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_GCM_CONFIG0                                                                                  0x3A
#define CLIF_GCM_CONFIG0_RESERVED_POS                                                                    (0UL)
#define CLIF_GCM_CONFIG0_RESERVED_MASK                                                                   (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_SS_TX1_CMCFG                                                                                 0x3B
#define CLIF_SS_TX1_CMCFG_RESERVED_POS                                                                   (22UL)
#define CLIF_SS_TX1_CMCFG_RESERVED_MASK                                                                  (0xFFC00000UL)  /**< 22-Reserved*/
#define CLIF_SS_TX1_CMCFG_TX1_CLK_MODE_MOD_CM_POS                                                        (19UL)
#define CLIF_SS_TX1_CMCFG_TX1_CLK_MODE_MOD_CM_MASK                                                       (0x00380000UL)  /**< 19-TX1 clock mode of modulated wave in CM*/
#define CLIF_SS_TX1_CMCFG_TX1_CLK_MODE_CW_CM_POS                                                         (16UL)
#define CLIF_SS_TX1_CMCFG_TX1_CLK_MODE_CW_CM_MASK                                                        (0x00070000UL)  /**< 16-TX1 clock mode of unmodulated wave in CM*/
#define CLIF_SS_TX1_CMCFG_TX1_AMP_MOD_CM_POS                                                             (8UL)
#define CLIF_SS_TX1_CMCFG_TX1_AMP_MOD_CM_MASK                                                            (0x0000FF00UL)  /**< 8-TX1 amplitude of modulated wave in CM*/
#define CLIF_SS_TX1_CMCFG_TX1_AMP_CW_CM_POS                                                              (0UL)
#define CLIF_SS_TX1_CMCFG_TX1_AMP_CW_CM_MASK                                                             (0x000000FFUL)  /**< 0-TX1 amplitude of unmodulated wave in CM*/

#define CLIF_SS_TX2_CMCFG                                                                                 0x3C
#define CLIF_SS_TX2_CMCFG_RESERVED_POS                                                                   (22UL)
#define CLIF_SS_TX2_CMCFG_RESERVED_MASK                                                                  (0xFFC00000UL)  /**< 22-Reserved*/
#define CLIF_SS_TX2_CMCFG_TX2_CLK_MODE_MOD_CM_POS                                                        (19UL)
#define CLIF_SS_TX2_CMCFG_TX2_CLK_MODE_MOD_CM_MASK                                                       (0x00380000UL)  /**< 19-TX2 clock mode of modulated wave in CM*/
#define CLIF_SS_TX2_CMCFG_TX2_CLK_MODE_CW_CM_POS                                                         (16UL)
#define CLIF_SS_TX2_CMCFG_TX2_CLK_MODE_CW_CM_MASK                                                        (0x00070000UL)  /**< 16-TX2 clock mode of unmodulated wave in CM*/
#define CLIF_SS_TX2_CMCFG_TX2_AMP_MOD_CM_POS                                                             (8UL)
#define CLIF_SS_TX2_CMCFG_TX2_AMP_MOD_CM_MASK                                                            (0x0000FF00UL)  /**< 8-TX2 amplitude of modulated wave in CM*/
#define CLIF_SS_TX2_CMCFG_TX2_AMP_CW_CM_POS                                                              (0UL)
#define CLIF_SS_TX2_CMCFG_TX2_AMP_CW_CM_MASK                                                             (0x000000FFUL)  /**< 0-TX2 amplitude of unmodulated wave in CM*/

#define CLIF_TIMER0_CONFIG                                                                                0x3D
#define CLIF_TIMER0_CONFIG_RESERVED_POS                                                                  (9UL)
#define CLIF_TIMER0_CONFIG_RESERVED_MASK                                                                 (0xFFFFFE00UL)  /**< 9-Reserved */
#define CLIF_TIMER0_CONFIG_T0_START_NOW_POS                                                              (8UL)
#define CLIF_TIMER0_CONFIG_T0_START_NOW_MASK                                                             (0x00000100UL)  /**< 8-T0_START_EVENT: If set. the timer T0 is started immediatly. */
#define CLIF_TIMER0_CONFIG_RESERVED1_POS                                                                 (7UL)
#define CLIF_TIMER0_CONFIG_RESERVED1_MASK                                                                (0x00000080UL)  /**< 7-Reserved */
#define CLIF_TIMER0_CONFIG_T0_ONE_SHOT_MODE_POS                                                          (6UL)
#define CLIF_TIMER0_CONFIG_T0_ONE_SHOT_MODE_MASK                                                         (0x00000040UL)  /**< 6-When set to 1 the counter value does not reload again until the counter value has reached zero*/
#define CLIF_TIMER0_CONFIG_T0_PRESCALE_SEL_POS                                                           (3UL)
#define CLIF_TIMER0_CONFIG_T0_PRESCALE_SEL_MASK                                                          (0x00000038UL)  /**< 3-Controls frequency/period of the timer T0 when the prescaler is activated in T0_MODE_SEL. 000b* 6.78MHz counter 001b 3.39MHz counter 010b 1.70MHz counter 011b 848kHz counter 100b 424kHz counter 101b 212kHz counter 110b 106kHz counter 111b 53kHz counter   */
#define CLIF_TIMER0_CONFIG_T0_MODE_SEL_POS                                                               (2UL)
#define CLIF_TIMER0_CONFIG_T0_MODE_SEL_MASK                                                              (0x00000004UL)  /**< 2-Configuration of the timer T0 clock. 0b* Prescaler is disabled: the timer frequency matches CLIF clock frequency (13.56MHz). 1b Prescaler is enabled: the timer operates on the prescaler signal frequency (chosen by T0_PRESCALE_SEL).*/
#define CLIF_TIMER0_CONFIG_T0_RELOAD_ENABLE_POS                                                          (1UL)
#define CLIF_TIMER0_CONFIG_T0_RELOAD_ENABLE_MASK                                                         (0x00000002UL)  /**< 1-If set to 0.the timer T0 will stop on expiration. 0* After expiration the timer T0 will stop counting. i.e.. remain zero. reset value. 1 After expiration the timer T0 will reload its preset value and continue counting down. */
#define CLIF_TIMER0_CONFIG_T0_ENABLE_POS                                                                 (0UL)
#define CLIF_TIMER0_CONFIG_T0_ENABLE_MASK                                                                (0x00000001UL)  /**< 0-Enables the timer T0*/

#define CLIF_TIMER0_RELOAD                                                                                0x3E
#define CLIF_TIMER0_RELOAD_RESERVED_POS                                                                  (20UL)
#define CLIF_TIMER0_RELOAD_RESERVED_MASK                                                                 (0xFFF00000UL)  /**< 20-Reserved */
#define CLIF_TIMER0_RELOAD_T0_RELOAD_VALUE_POS                                                           (0UL)
#define CLIF_TIMER0_RELOAD_T0_RELOAD_VALUE_MASK                                                          (0x000FFFFFUL)  /**< 0-Reload value of the timer T0. */

