QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5190_Reg.h
#define CLIF_ANA_STATUS                                                                                   0x41
#define CLIF_ANA_STATUS_RESERVED_POS                                                                     (21UL)
#define CLIF_ANA_STATUS_RESERVED_MASK                                                                    (0xFFE00000UL)  /**< 21-reserved*/
#define CLIF_ANA_STATUS_ADC_DATA_I_POS                                                                   (11UL)
#define CLIF_ANA_STATUS_ADC_DATA_I_MASK                                                                  (0x001FF800UL)  /**< 11-RX adc I output for validation purposes*/
#define CLIF_ANA_STATUS_ADC_DATA_Q_POS                                                                   (1UL)
#define CLIF_ANA_STATUS_ADC_DATA_Q_MASK                                                                  (0x000007FEUL)  /**< 1-RX adc Q output for validation purposes*/
#define CLIF_ANA_STATUS_PLL_LOCK_STATUS_POS                                                              (0UL)
#define CLIF_ANA_STATUS_PLL_LOCK_STATUS_MASK                                                             (0x00000001UL)  /**< 0-PLL lock status indicator*/

#define CLIF_ANA_RX_CTRL                                                                                  0x43
#define CLIF_ANA_RX_CTRL_RESERVED_POS                                                                    (0UL)
#define CLIF_ANA_RX_CTRL_RESERVED_MASK                                                                   (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define CLIF_RX_EMD_0_CONFIG                                                                              0x48
#define CLIF_RX_EMD_0_CONFIG_RESERVED_POS                                                                (0UL)
#define CLIF_RX_EMD_0_CONFIG_RESERVED_MASK                                                               (0xFFFFFFFFUL)  /**< 0-Reserved*/

#define LPCD_CALIBRATE_CTRL                                                                               0x50
#define LPCD_CALIBRATE_CTRL_FREEZE_VALUES_POS                                                            (30UL)
#define LPCD_CALIBRATE_CTRL_FREEZE_VALUES_MASK                                                           (0x40000000UL)  /**< 30-Freeze the RSSI Target and hysteresis values into UserArea*/
#define LPCD_CALIBRATE_CTRL_RFU_POS                                                                      (24UL)
#define LPCD_CALIBRATE_CTRL_RFU_MASK                                                                     (0x3F000000UL)  /**< 24-Reserved*/
#define LPCD_CALIBRATE_CTRL_RSSI_HYSTERESIS_POS                                                          (16UL)
#define LPCD_CALIBRATE_CTRL_RSSI_HYSTERESIS_MASK                                                         (0x00FF0000UL)  /**< 16-[REG] Value to be set in CLIF_DGRM_RSSI_REG_DGRM_RSSI_HYST used for calibration*/
#define LPCD_CALIBRATE_CTRL_RSSI_TARGET_POS                                                              (0UL)
#define LPCD_CALIBRATE_CTRL_RSSI_TARGET_MASK                                                             (0x0000FFFFUL)  /**< 0-[REG] Value to be set in CLIF_DGRM_RSSI_REG_DGRM_RSSI_TARGET used for calibration*/

#define IQ_CHANNEL_VALS                                                                                   0x51
#define IQ_CHANNEL_VALS_Q_CHANNEL_VAL_POS                                                                (16UL)
#define IQ_CHANNEL_VALS_Q_CHANNEL_VAL_MASK                                                               (0xFFFF0000UL)  /**< 16-Q Channel value*/
#define IQ_CHANNEL_VALS_I_CHANNEL_VAL_POS                                                                (0UL)
#define IQ_CHANNEL_VALS_I_CHANNEL_VAL_MASK                                                               (0x0000FFFFUL)  /**< 0-I Channel value*/

#define PAD_CONFIG                                                                                        0x52
#define PAD_CONFIG_RESERVED_POS                                                                          (7UL)
#define PAD_CONFIG_RESERVED_MASK                                                                         (0x3FFFFF80UL)  /**< 7-RESERVED*/
#define PAD_CONFIG_AUX3_OUTPUT_VAL_POS                                                                   (6UL)
#define PAD_CONFIG_AUX3_OUTPUT_VAL_MASK                                                                  (0x00000040UL)  /**< 6-Output value for AUX3*/
#define PAD_CONFIG_AUX2_OUTPUT_VAL_POS                                                                   (5UL)
#define PAD_CONFIG_AUX2_OUTPUT_VAL_MASK                                                                  (0x00000020UL)  /**< 5-Output value for AUX2*/
#define PAD_CONFIG_AUX1_OUTPUT_VAL_POS                                                                   (4UL)
#define PAD_CONFIG_AUX1_OUTPUT_VAL_MASK                                                                  (0x00000010UL)  /**< 4-Output value for AUX1*/
#define PAD_CONFIG_GPIO3_OUTPUT_VAL_POS                                                                  (3UL)
#define PAD_CONFIG_GPIO3_OUTPUT_VAL_MASK                                                                 (0x00000008UL)  /**< 3-Output value for GPIO3*/
#define PAD_CONFIG_GPIO2_OUTPUT_VAL_POS                                                                  (2UL)
#define PAD_CONFIG_GPIO2_OUTPUT_VAL_MASK                                                                 (0x00000004UL)  /**< 2-Output value for GPIO2*/
#define PAD_CONFIG_GPIO1_OUTPUT_VAL_POS                                                                  (1UL)
#define PAD_CONFIG_GPIO1_OUTPUT_VAL_MASK                                                                 (0x00000002UL)  /**< 1-Output value for GPIO1*/
#define PAD_CONFIG_GPIO0_OUTPUT_VAL_POS                                                                  (0UL)
#define PAD_CONFIG_GPIO0_OUTPUT_VAL_MASK                                                                 (0x00000001UL)  /**< 0-Output value for GPIO0*/

#define GENERAL_STATUS                                                                                    0x53
#define GENERAL_STATUS_LPCD_CALIBRATION_STATUS_POS                                                       (31UL)
#define GENERAL_STATUS_LPCD_CALIBRATION_STATUS_MASK                                                      (0x80000000UL)  /**< 31-LPD Calibration Status 0 - Calibration Not Done, 1- Calibration Done*/
#define GENERAL_STATUS_TXNOV_CALIBRATION_STATUS_POS                                                      (0UL)
#define GENERAL_STATUS_TXNOV_CALIBRATION_STATUS_MASK                                                     (0x00000001UL)  /**< 0-TXNOV Calibration Status 0 - Calibration Not Done, 1- Calibration Done*/

#define TXLDO_VDDPA_CONFIG                                                                                0x54
#define TXLDO_VDDPA_CONFIG_RESERVED_POS                                                                  (8UL)
#define TXLDO_VDDPA_CONFIG_RESERVED_MASK                                                                 (0xFFFFFF00UL)  /**< 8-Reserved*/
#define TXLDO_VDDPA_CONFIG_VDDPA_CONFIG_POS                                                              (0UL)
#define TXLDO_VDDPA_CONFIG_VDDPA_CONFIG_MASK                                                             (0x000000FFUL)  /**< 0-Configures the VDDPA to the value set*/

#define GENERAL_ERROR_STATUS                                                                              0x55
#define GENERAL_ERROR_STATUS_RFU_POS                                                                     (3UL)
#define GENERAL_ERROR_STATUS_RFU_MASK                                                                    (0xFFFFFFF8UL)  /**< 3-Reserved*/
#define GENERAL_ERROR_STATUS_TXLDO_ERROR_POS                                                             (2UL)
#define GENERAL_ERROR_STATUS_TXLDO_ERROR_MASK                                                            (0x00000004UL)  /**< 2-TXLDO Error*/
#define GENERAL_ERROR_STATUS_CLOCK_ERROR_POS                                                             (1UL)
#define GENERAL_ERROR_STATUS_CLOCK_ERROR_MASK                                                            (0x00000002UL)  /**< 1-CLOCK Error*/
#define GENERAL_ERROR_STATUS_GPADC_ERROR_POS                                                             (0UL)
#define GENERAL_ERROR_STATUS_GPADC_ERROR_MASK                                                            (0x00000001UL)  /**< 0-GPADC Error*/

#define TXLDO_VOUT_CURR                                                                                   0x56
#define TXLDO_VOUT_CURR_TXLDO_CURRENT_POS                                                                (8UL)
#define TXLDO_VOUT_CURR_TXLDO_CURRENT_MASK                                                               (0x00FFFF00UL)  /**< 8-Incdicates the TXLDO Current*/
#define TXLDO_VOUT_CURR_VDDPA_VOUT_POS                                                                   (0UL)
#define TXLDO_VOUT_CURR_VDDPA_VOUT_MASK                                                                  (0x000000FFUL)  /**< 0-Indicates the current VDDPA Voltage configured*/

#define PCRM_CLIF_DAC                                                                                     0x57
#define PCRM_CLIF_DAC_RESERVED_POS                                                                       (28UL)
#define PCRM_CLIF_DAC_RESERVED_MASK                                                                      (0xF0000000UL)  /**< 28-reserved*/
#define PCRM_CLIF_DAC_TUNING_DAC_2_OFFSET_CTRL_POS                                                       (24UL)
#define PCRM_CLIF_DAC_TUNING_DAC_2_OFFSET_CTRL_MASK                                                      (0x0F000000UL)  /**< 24-x111=2V, x110=3V,x100=3.45V,x000=3.8V*/
#define PCRM_CLIF_DAC_TUNING_DAC_2_CTRL_POS                                                              (17UL)
#define PCRM_CLIF_DAC_TUNING_DAC_2_CTRL_MASK                                                             (0x00FE0000UL)  /**< 17-Output voltage of DAC2 according to 1/128 *<TUNING_DAC_2_CTRL> *  <Range in V>*/
#define PCRM_CLIF_DAC_TUNING_DAC_2_PD_POS                                                                (16UL)
#define PCRM_CLIF_DAC_TUNING_DAC_2_PD_MASK                                                               (0x00010000UL)  /**< 16-0=DAC Turned off, 1=DAC enabled*/
#define PCRM_CLIF_DAC_RESERVED1_POS                                                                      (12UL)
#define PCRM_CLIF_DAC_RESERVED1_MASK                                                                     (0x0000F000UL)  /**< 12-reserved*/
#define PCRM_CLIF_DAC_TUNING_DAC_1_OFFSET_CTRL_POS                                                       (8UL)
#define PCRM_CLIF_DAC_TUNING_DAC_1_OFFSET_CTRL_MASK                                                      (0x00000F00UL)  /**< 8-x111=2V, x110=3V,x100=3.45V,x000=3.8V*/
#define PCRM_CLIF_DAC_TUNING_DAC_1_CTRL_POS                                                              (1UL)
#define PCRM_CLIF_DAC_TUNING_DAC_1_CTRL_MASK                                                             (0x000000FEUL)  /**< 1-Output voltage of DAC1 according to 1/128 *<TUNING_DAC_1_CTRL> *  <Range in V>*/
#define PCRM_CLIF_DAC_TUNING_DAC_1_PD_POS                                                                (0UL)
#define PCRM_CLIF_DAC_TUNING_DAC_1_PD_MASK                                                               (0x00000001UL)  /**< 0-0=DAC Turned off, 1=DAC enabled*/

