QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5190_Reg.h
#define PCRM_PMU_ANA_SMPS_CTRL                                                                            0x58
#define PCRM_PMU_ANA_SMPS_CTRL_RESERVED_POS                                                              (30UL)
#define PCRM_PMU_ANA_SMPS_CTRL_RESERVED_MASK                                                             (0xC0000000UL)  /**< 30-reserved*/
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_MAXDT_SEL_POS                                                        (27UL)
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_MAXDT_SEL_MASK                                                       (0x38000000UL)  /**< 27-SMPS max duty cycle value, valid when SMPS_MAX_DTC_BYPASS is set*/
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_MAXDT_SEL_BYPASS_POS                                                 (26UL)
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_MAXDT_SEL_BYPASS_MASK                                                (0x04000000UL)  /**< 26-SMPS max duty cycle lookup table bypass */
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_GM_POS                                                               (24UL)
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_GM_MASK                                                              (0x03000000UL)  /**< 24-SMPS Gm set up*/
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_RSENSE_POS                                                           (22UL)
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_RSENSE_MASK                                                          (0x00C00000UL)  /**< 22-SMPS Rsense set up*/
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_SOFT_START_POS                                                       (20UL)
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_SOFT_START_MASK                                                      (0x00300000UL)  /**< 20-SMPS Soft Start set up*/
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_SAWTOOTHGEN_POS                                                      (17UL)
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_SAWTOOTHGEN_MASK                                                     (0x000E0000UL)  /**< 17-SMPS Sawtooth generator set up*/
#define PCRM_PMU_ANA_SMPS_CTRL_RESERVED1_POS                                                             (14UL)
#define PCRM_PMU_ANA_SMPS_CTRL_RESERVED1_MASK                                                            (0x0001C000UL)  /**< 14-reserved*/
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_PROT_UNDERSHOOT_VTH_POS                                              (12UL)
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_PROT_UNDERSHOOT_VTH_MASK                                             (0x00003000UL)  /**< 12-SMPS */
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_REG_SPARE_0_POS                                                      (10UL)
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_REG_SPARE_0_MASK                                                     (0x00000C00UL)  /**< 10-SMPS */
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_PID_POS                                                              (7UL)
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_PID_MASK                                                             (0x00000380UL)  /**< 7-SMPS PID filter set up*/
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_VDDBOOST_VOUT_SEL_POS                                                (1UL)
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_VDDBOOST_VOUT_SEL_MASK                                               (0x0000007EUL)  /**< 1-SMPS Ouput voltage selection*/
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_EN_POS                                                               (0UL)
#define PCRM_PMU_ANA_SMPS_CTRL_SMPS_EN_MASK                                                              (0x00000001UL)  /**< 0-SMPS enable*/

#define CLIF_RXM_FREQ                                                                                     0x59
#define CLIF_RXM_FREQ_RXM_FREQ_REG_VALID_POS                                                             (31UL)
#define CLIF_RXM_FREQ_RXM_FREQ_REG_VALID_MASK                                                            (0x80000000UL)  /**< 31-CLIF_RXM_FREQ_REG fields are valid*/
#define CLIF_RXM_FREQ_RESERVED_POS                                                                       (25UL)
#define CLIF_RXM_FREQ_RESERVED_MASK                                                                      (0x7E000000UL)  /**< 25-Reserved*/
#define CLIF_RXM_FREQ_RXM_FREQ_POS                                                                       (16UL)
#define CLIF_RXM_FREQ_RXM_FREQ_MASK                                                                      (0x01FF0000UL)  /**< 16-frequence difference between the last two consecutive measures at 1.7 MHz (multiple of 13.56MHz/4096). Signed. 2-Complement coded.*/
#define CLIF_RXM_FREQ_RESERVED1_POS                                                                      (9UL)
#define CLIF_RXM_FREQ_RESERVED1_MASK                                                                     (0x0000FE00UL)  /**< 9-Reserved*/
#define CLIF_RXM_FREQ_RXM_PHASE_POS                                                                      (0UL)
#define CLIF_RXM_FREQ_RXM_PHASE_MASK                                                                     (0x000001FFUL)  /**< 0-phase value from CORDIC*/

#define CLIF_RXM_RSSI                                                                                     0x5A
#define CLIF_RXM_RSSI_RESERVED_POS                                                                       (23UL)
#define CLIF_RXM_RSSI_RESERVED_MASK                                                                      (0xFF800000UL)  /**< 23-Reserved*/
#define CLIF_RXM_RSSI_RXM_RSSI_FROZEN_POS                                                                (22UL)
#define CLIF_RXM_RSSI_RXM_RSSI_FROZEN_MASK                                                               (0x00400000UL)  /**< 22-The RSSI value is not currently updated*/
#define CLIF_RXM_RSSI_RXM_FRQ_OK_POS                                                                     (21UL)
#define CLIF_RXM_RSSI_RXM_FRQ_OK_MASK                                                                    (0x00200000UL)  /**< 21-The carrier frequency detected is OK.*/
#define CLIF_RXM_RSSI_RXM_RSSI_REG_VALID_POS                                                             (20UL)
#define CLIF_RXM_RSSI_RXM_RSSI_REG_VALID_MASK                                                            (0x00100000UL)  /**< 20-CLIF_RXM_RSSI_REG fields are valid*/
#define CLIF_RXM_RSSI_RXM_HFATT_POS                                                                      (14UL)
#define CLIF_RXM_RSSI_RXM_HFATT_MASK                                                                     (0x000FC000UL)  /**< 14-HFAtt latched with RSSI*/
#define CLIF_RXM_RSSI_RXM_RSSI_POS                                                                       (0UL)
#define CLIF_RXM_RSSI_RXM_RSSI_MASK                                                                      (0x00003FFFUL)  /**< 0-RSSI value*/

