QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5190_Reg.h
#define PMU_TEMP_REG                                                                                      0x5B
#define PMU_TEMP_REG_PMU_TEMPERATURE_POS                                                                 (0UL)
#define PMU_TEMP_REG_PMU_TEMPERATURE_MASK                                                                (0x0000FFFFUL)  /**< 0-PMU temperature*/

#define INTERPOLATED_RSSI_REG                                                                             0x5C
#define INTERPOLATED_RSSI_REG_INTERPOLATED_RSSI_POS                                                      (0UL)
#define INTERPOLATED_RSSI_REG_INTERPOLATED_RSSI_MASK                                                     (0xFFFFFFFFUL)  /**< 0-Calculated Interpolated RSSI*/

#define TX_NOV_CALIBRATE_AND_STORE_VAL_REG                                                                0x5D
#define TX_NOV_CALIBRATE_AND_STORE_VAL_REG_RFU_POS                                                       (2UL)
#define TX_NOV_CALIBRATE_AND_STORE_VAL_REG_RFU_MASK                                                      (0xFFFFFFFCUL)  /**< 2-Reserved*/
#define TX_NOV_CALIBRATE_AND_STORE_VAL_REG_TX_NOV_CALIBRATE_STORE_POS                                    (0UL)
#define TX_NOV_CALIBRATE_AND_STORE_VAL_REG_TX_NOV_CALIBRATE_STORE_MASK                                   (0x00000003UL)  /**< 0-Perform TX_NOV Calibration and store in User Area*/

#define DPC_CONFIG                                                                                        0x5E
#define DPC_CONFIG_DPC_REG_ACCESS_POS                                                                    (31UL)
#define DPC_CONFIG_DPC_REG_ACCESS_MASK                                                                   (0x80000000UL)  /**< 31- This bit is used to control access to the register. 1: access allowed.This bit needs to be SET to enable/disable the functionality of bit 0. */
#define DPC_CONFIG_RESERVED_POS                                                                          (1UL)
#define DPC_CONFIG_RESERVED_MASK                                                                         (0x7FFFFFFEUL)  /**< 1-RESERVED*/
#define DPC_CONFIG_ENABLE_DISABLE_DPC_POS                                                                (0UL)
#define DPC_CONFIG_ENABLE_DISABLE_DPC_MASK                                                               (0x00000001UL)  /**< 0- If set to 1, to Enable DPC. Set to 0 to disable DPC*/

#define CLIF_TIMER0_OUTPUT                                                                                0x5F
#define CLIF_TIMER0_OUTPUT_RESERVED_POS                                                                  (25UL)
#define CLIF_TIMER0_OUTPUT_RESERVED_MASK                                                                 (0xFE000000UL)  /**< 25-Reserved */
#define CLIF_TIMER0_OUTPUT_T0_RUNNING_POS                                                                (24UL)
#define CLIF_TIMER0_OUTPUT_T0_RUNNING_MASK                                                               (0x01000000UL)  /**< 24-Indicates that timer T0 is running (busy) */
#define CLIF_TIMER0_OUTPUT_RESERVED1_POS                                                                  (20UL)
#define CLIF_TIMER0_OUTPUT_RESERVED1_MASK                                                                 (0x00F00000UL)  /**< 20-Reserved */
#define CLIF_TIMER0_OUTPUT_T0_VALUE_POS                                                                  (0UL)
#define CLIF_TIMER0_OUTPUT_T0_VALUE_MASK                                                                 (0x000FFFFFUL)  /**< 0-Value of 20bit counter in timer T0 */

#define CLIF_TIMER1_OUTPUT                                                                                0x60
#define CLIF_TIMER1_OUTPUT_RESERVED_POS                                                                  (25UL)
#define CLIF_TIMER1_OUTPUT_RESERVED_MASK                                                                 (0xFE000000UL)  /**< 25-Reserved */
#define CLIF_TIMER1_OUTPUT_T1_RUNNING_POS                                                                (24UL)
#define CLIF_TIMER1_OUTPUT_T1_RUNNING_MASK                                                               (0x01000000UL)  /**< 24-Indicates that timer T1 is running (busy) */
#define CLIF_TIMER1_OUTPUT_RESERVED1_POS                                                                  (20UL)
#define CLIF_TIMER1_OUTPUT_RESERVED1_MASK                                                                 (0x00F00000UL)  /**< 20-Reserved */
#define CLIF_TIMER1_OUTPUT_T1_VALUE_POS                                                                  (0UL)
#define CLIF_TIMER1_OUTPUT_T1_VALUE_MASK                                                                 (0x000FFFFFUL)  /**< 0-Value of 20bit counter in timer T1 */

#define CLIF_TIMER2_CONFIG                                                                                0x61
#define CLIF_TIMER2_CONFIG_RESERVED_POS                                                                  (31UL)
#define CLIF_TIMER2_CONFIG_RESERVED_MASK                                                                 (0x80000000UL)  /**< 31-Reserved */
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_RX_STARTED_POS                                                     (30UL)
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_RX_STARTED_MASK                                                    (0x40000000UL)  /**< 30-T2_STOP_EVENT: If set. the timer T2 is stopped when a data reception begins (1st bit is received). */
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_TX_STARTED_POS                                                     (29UL)
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_TX_STARTED_MASK                                                    (0x20000000UL)  /**< 29-T2_STOP_EVENT: If set. the timer T2 is stopped when a data transmission begins. */
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_RF_ON_EXT_POS                                                      (28UL)
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_RF_ON_EXT_MASK                                                     (0x10000000UL)  /**< 28-T2_STOP_EVENT: If set. the timer T2 is stopped when the external RF field is detected. */
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_RF_OFF_EXT_POS                                                     (27UL)
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_RF_OFF_EXT_MASK                                                    (0x08000000UL)  /**< 27-T2_STOP_EVENT: If set. the timer T2 is stopped when the external RF field vanishes. */
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_RF_ON_INT_POS                                                      (26UL)
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_RF_ON_INT_MASK                                                     (0x04000000UL)  /**< 26-T2_STOP_EVENT: If set. the timer T2 is stopped when the internal RF field is turned on. */
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_RF_OFF_INT_POS                                                     (25UL)
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_RF_OFF_INT_MASK                                                    (0x02000000UL)  /**< 25-T2_STOP_EVENT: If set. the timer T2 is stopped when the internal RF field is turned off. */
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_RX_ENDED_POS                                                       (24UL)
#define CLIF_TIMER2_CONFIG_T2_STOP_ON_RX_ENDED_MASK                                                      (0x01000000UL)  /**< 24-T2_STOP_EVENT: If set the timer T2 is stopped when an activity on RX is detected.*/
#define CLIF_TIMER2_CONFIG_RESERVED1_POS                                                                  (18UL)
#define CLIF_TIMER2_CONFIG_RESERVED1_MASK                                                                 (0x00FC0000UL)  /**< 18-Reserved */
#define CLIF_TIMER2_CONFIG_T2_START_ON_RX_STARTED_POS                                                    (17UL)
#define CLIF_TIMER2_CONFIG_T2_START_ON_RX_STARTED_MASK                                                   (0x00020000UL)  /**< 17-T2_START_EVENT: If set. the timer T2 is started when a data reception begins (1st bit is received). */
#define CLIF_TIMER2_CONFIG_T2_START_ON_RX_ENDED_POS                                                      (16UL)
#define CLIF_TIMER2_CONFIG_T2_START_ON_RX_ENDED_MASK                                                     (0x00010000UL)  /**< 16-T2_START_EVENT: If set. the timer T2 is started when a data reception ends. */
#define CLIF_TIMER2_CONFIG_T2_START_ON_TX_STARTED_POS                                                    (15UL)
#define CLIF_TIMER2_CONFIG_T2_START_ON_TX_STARTED_MASK                                                   (0x00008000UL)  /**< 15-T2_START_EVENT: If set. the timer T2 is started when a data transmission begins. */
#define CLIF_TIMER2_CONFIG_T2_START_ON_TX_ENDED_POS                                                      (14UL)
#define CLIF_TIMER2_CONFIG_T2_START_ON_TX_ENDED_MASK                                                     (0x00004000UL)  /**< 14-T2_START_EVENT: If set. the timer T2 is started when a data transmission ends. */
#define CLIF_TIMER2_CONFIG_T2_START_ON_RF_ON_EXT_POS                                                     (13UL)
#define CLIF_TIMER2_CONFIG_T2_START_ON_RF_ON_EXT_MASK                                                    (0x00002000UL)  /**< 13-T2_START_EVENT: If set. the timer T2 is started when the external RF field is detected. */
#define CLIF_TIMER2_CONFIG_T2_START_ON_RF_OFF_EXT_POS                                                    (12UL)
#define CLIF_TIMER2_CONFIG_T2_START_ON_RF_OFF_EXT_MASK                                                   (0x00001000UL)  /**< 12-T2_START_EVENT: If set. the timer T2 is started when the external RF field is not detected any more. */
#define CLIF_TIMER2_CONFIG_T2_START_ON_RF_ON_INT_POS                                                     (11UL)
#define CLIF_TIMER2_CONFIG_T2_START_ON_RF_ON_INT_MASK                                                    (0x00000800UL)  /**< 11-T2_START_EVENT: If set. the timer T2 is started when an internal RF field is turned on. */
#define CLIF_TIMER2_CONFIG_T2_START_ON_RF_OFF_INT_POS                                                    (10UL)
#define CLIF_TIMER2_CONFIG_T2_START_ON_RF_OFF_INT_MASK                                                   (0x00000400UL)  /**< 10-T2_START_EVENT: If set. the timer T2 is started when an internal RF field is turned off. */
#define CLIF_TIMER2_CONFIG_T2_START_ON_TX_FRAMESTEP_POS                                                  (9UL)
#define CLIF_TIMER2_CONFIG_T2_START_ON_TX_FRAMESTEP_MASK                                                 (0x00000200UL)  /**< 9-T2_START_EVENT: If set the timer T2 is started when an activity on Framestep is detected.*/
#define CLIF_TIMER2_CONFIG_T2_START_NOW_POS                                                              (8UL)
#define CLIF_TIMER2_CONFIG_T2_START_NOW_MASK                                                             (0x00000100UL)  /**< 8-T2_START_EVENT: If set. the timer T2 is started immediatly. */
#define CLIF_TIMER2_CONFIG_RESERVED2_POS                                                                  (7UL)
#define CLIF_TIMER2_CONFIG_RESERVED2_MASK                                                                 (0x00000080UL)  /**< 7-Reserved           */
#define CLIF_TIMER2_CONFIG_T2_ONE_SHOT_MODE_POS                                                          (6UL)
#define CLIF_TIMER2_CONFIG_T2_ONE_SHOT_MODE_MASK                                                         (0x00000040UL)  /**< 6-When set to 1 the counter value does not reload again until the counter value has reached zero*/
#define CLIF_TIMER2_CONFIG_T2_PRESCALE_SEL_POS                                                           (3UL)
#define CLIF_TIMER2_CONFIG_T2_PRESCALE_SEL_MASK                                                          (0x00000038UL)  /**< 3-Controls frequency/period of the timer T2 when the prescaler is activated by T2_MODE_SEL. 000b* 6.78MHz counter 001b 3.39MHz counter 010b 1.70MHz counter 011b 848kHz counter 100b 424kHz counter 101b 212kHz counter 110b 106kHz counter 111b 53kHz counter */
#define CLIF_TIMER2_CONFIG_T2_MODE_SEL_POS                                                               (2UL)
#define CLIF_TIMER2_CONFIG_T2_MODE_SEL_MASK                                                              (0x00000004UL)  /**< 2-If set. the timer T2 is started the prescaler for the timer T2 is enabled. 0* Prescaler is disabled: the timer frequency matches CLIF clock frequency (13.56MHz). 1 Prescaler is enabled: the timer operates on the prescaler signal frequency (chosen by T2_PRESCALE_SEL). */
#define CLIF_TIMER2_CONFIG_T2_RELOAD_ENABLE_POS                                                          (1UL)
#define CLIF_TIMER2_CONFIG_T2_RELOAD_ENABLE_MASK                                                         (0x00000002UL)  /**< 1-If set to 0.the timer T2 will stop on expiration. 0* After expiration the timer T2 will stop counting. i.e.. remain zero. reset value. 1 After expiration the timer T2 will reload its preset value and continue counting down. */
#define CLIF_TIMER2_CONFIG_T2_ENABLE_POS                                                                 (0UL)
#define CLIF_TIMER2_CONFIG_T2_ENABLE_MASK                                                                (0x00000001UL)  /**< 0-Enables the timer T2 */

#define CLIF_TIMER2_RELOAD                                                                                0x62
#define CLIF_TIMER2_RELOAD_RESERVED_POS                                                                  (20UL)
#define CLIF_TIMER2_RELOAD_RESERVED_MASK                                                                 (0xFFF00000UL)  /**< 20-Reserved */
#define CLIF_TIMER2_RELOAD_T2_RELOAD_VALUE_POS                                                           (0UL)
#define CLIF_TIMER2_RELOAD_T2_RELOAD_VALUE_MASK                                                          (0x000FFFFFUL)  /**< 0-Reload value of the timer T2. */

