QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5190_Reg.h
#define CLIF_TIMER2_OUTPUT                                                                                0x63
#define CLIF_TIMER2_OUTPUT_RESERVED_POS                                                                  (25UL)
#define CLIF_TIMER2_OUTPUT_RESERVED_MASK                                                                 (0xFE000000UL)  /**< 25-Reserved */
#define CLIF_TIMER2_OUTPUT_T2_RUNNING_POS                                                                (24UL)
#define CLIF_TIMER2_OUTPUT_T2_RUNNING_MASK                                                               (0x01000000UL)  /**< 24-Indicates that timer T2 is running (busy) */
#define CLIF_TIMER2_OUTPUT_RESERVED1_POS                                                                  (20UL)
#define CLIF_TIMER2_OUTPUT_RESERVED1_MASK                                                                 (0x00F00000UL)  /**< 20-Reserved */
#define CLIF_TIMER2_OUTPUT_T2_VALUE_POS                                                                  (0UL)
#define CLIF_TIMER2_OUTPUT_T2_VALUE_MASK                                                                 (0x000FFFFFUL)  /**< 0-Value of 20bit counter in timer T2*/

#define CLIF_SS_TX1_RTRANS0                                                                               0x80
#define CLIF_SS_TX1_RTRANS0_TX1_SS_RTRANS3_POS                                                           (24UL)
#define CLIF_SS_TX1_RTRANS0_TX1_SS_RTRANS3_MASK                                                          (0xFF000000UL)  /**< 24-TX1 rising transition value 3*/
#define CLIF_SS_TX1_RTRANS0_TX1_SS_RTRANS2_POS                                                           (16UL)
#define CLIF_SS_TX1_RTRANS0_TX1_SS_RTRANS2_MASK                                                          (0x00FF0000UL)  /**< 16-TX1 rising transition value 2*/
#define CLIF_SS_TX1_RTRANS0_TX1_SS_RTRANS1_POS                                                           (8UL)
#define CLIF_SS_TX1_RTRANS0_TX1_SS_RTRANS1_MASK                                                          (0x0000FF00UL)  /**< 8-TX1 rising transition value 1*/
#define CLIF_SS_TX1_RTRANS0_TX1_SS_RTRANS0_POS                                                           (0UL)
#define CLIF_SS_TX1_RTRANS0_TX1_SS_RTRANS0_MASK                                                          (0x000000FFUL)  /**< 0-TX1 rising transition value 0*/

#define CLIF_SS_TX1_RTRANS1                                                                               0x81
#define CLIF_SS_TX1_RTRANS1_TX1_SS_RTRANS7_POS                                                           (24UL)
#define CLIF_SS_TX1_RTRANS1_TX1_SS_RTRANS7_MASK                                                          (0xFF000000UL)  /**< 24-TX1 rising transition value 7*/
#define CLIF_SS_TX1_RTRANS1_TX1_SS_RTRANS6_POS                                                           (16UL)
#define CLIF_SS_TX1_RTRANS1_TX1_SS_RTRANS6_MASK                                                          (0x00FF0000UL)  /**< 16-TX1 rising transition value 6*/
#define CLIF_SS_TX1_RTRANS1_TX1_SS_RTRANS5_POS                                                           (8UL)
#define CLIF_SS_TX1_RTRANS1_TX1_SS_RTRANS5_MASK                                                          (0x0000FF00UL)  /**< 8-TX1 rising transition value 5*/
#define CLIF_SS_TX1_RTRANS1_TX1_SS_RTRANS4_POS                                                           (0UL)
#define CLIF_SS_TX1_RTRANS1_TX1_SS_RTRANS4_MASK                                                          (0x000000FFUL)  /**< 0-TX1 rising transition value 4*/

#define CLIF_SS_TX1_RTRANS2                                                                               0x82
#define CLIF_SS_TX1_RTRANS2_TX1_SS_RTRANS11_POS                                                          (24UL)
#define CLIF_SS_TX1_RTRANS2_TX1_SS_RTRANS11_MASK                                                         (0xFF000000UL)  /**< 24-TX1 rising transition value 11*/
#define CLIF_SS_TX1_RTRANS2_TX1_SS_RTRANS10_POS                                                          (16UL)
#define CLIF_SS_TX1_RTRANS2_TX1_SS_RTRANS10_MASK                                                         (0x00FF0000UL)  /**< 16-TX1 rising transition value 10*/
#define CLIF_SS_TX1_RTRANS2_TX1_SS_RTRANS9_POS                                                           (8UL)
#define CLIF_SS_TX1_RTRANS2_TX1_SS_RTRANS9_MASK                                                          (0x0000FF00UL)  /**< 8-TX1 rising transition value 9*/
#define CLIF_SS_TX1_RTRANS2_TX1_SS_RTRANS8_POS                                                           (0UL)
#define CLIF_SS_TX1_RTRANS2_TX1_SS_RTRANS8_MASK                                                          (0x000000FFUL)  /**< 0-TX1 rising transition value 8*/

#define CLIF_SS_TX1_RTRANS3                                                                               0x83
#define CLIF_SS_TX1_RTRANS3_TX1_SS_RTRANS15_POS                                                          (24UL)
#define CLIF_SS_TX1_RTRANS3_TX1_SS_RTRANS15_MASK                                                         (0xFF000000UL)  /**< 24-TX1 rising transition value 15*/
#define CLIF_SS_TX1_RTRANS3_TX1_SS_RTRANS14_POS                                                          (16UL)
#define CLIF_SS_TX1_RTRANS3_TX1_SS_RTRANS14_MASK                                                         (0x00FF0000UL)  /**< 16-TX1 rising transition value 14*/
#define CLIF_SS_TX1_RTRANS3_TX1_SS_RTRANS13_POS                                                          (8UL)
#define CLIF_SS_TX1_RTRANS3_TX1_SS_RTRANS13_MASK                                                         (0x0000FF00UL)  /**< 8-TX1 rising transition value 13*/
#define CLIF_SS_TX1_RTRANS3_TX1_SS_RTRANS12_POS                                                          (0UL)
#define CLIF_SS_TX1_RTRANS3_TX1_SS_RTRANS12_MASK                                                         (0x000000FFUL)  /**< 0-TX1 rising transition value 12*/

#define CLIF_SS_TX2_RTRANS0                                                                               0x84
#define CLIF_SS_TX2_RTRANS0_TX2_SS_RTRANS3_POS                                                           (24UL)
#define CLIF_SS_TX2_RTRANS0_TX2_SS_RTRANS3_MASK                                                          (0xFF000000UL)  /**< 24-TX2 rising transition value 3*/
#define CLIF_SS_TX2_RTRANS0_TX2_SS_RTRANS2_POS                                                           (16UL)
#define CLIF_SS_TX2_RTRANS0_TX2_SS_RTRANS2_MASK                                                          (0x00FF0000UL)  /**< 16-TX2 rising transition value 2*/
#define CLIF_SS_TX2_RTRANS0_TX2_SS_RTRANS1_POS                                                           (8UL)
#define CLIF_SS_TX2_RTRANS0_TX2_SS_RTRANS1_MASK                                                          (0x0000FF00UL)  /**< 8-TX2 rising transition value 1*/
#define CLIF_SS_TX2_RTRANS0_TX2_SS_RTRANS0_POS                                                           (0UL)
#define CLIF_SS_TX2_RTRANS0_TX2_SS_RTRANS0_MASK                                                          (0x000000FFUL)  /**< 0-TX2 rising transition value 0*/

#define CLIF_SS_TX2_RTRANS1                                                                               0x85
#define CLIF_SS_TX2_RTRANS1_TX2_SS_RTRANS7_POS                                                           (24UL)
#define CLIF_SS_TX2_RTRANS1_TX2_SS_RTRANS7_MASK                                                          (0xFF000000UL)  /**< 24-TX2 rising transition value 7*/
#define CLIF_SS_TX2_RTRANS1_TX2_SS_RTRANS6_POS                                                           (16UL)
#define CLIF_SS_TX2_RTRANS1_TX2_SS_RTRANS6_MASK                                                          (0x00FF0000UL)  /**< 16-TX2 rising transition value 6*/
#define CLIF_SS_TX2_RTRANS1_TX2_SS_RTRANS5_POS                                                           (8UL)
#define CLIF_SS_TX2_RTRANS1_TX2_SS_RTRANS5_MASK                                                          (0x0000FF00UL)  /**< 8-TX2 rising transition value 5*/
#define CLIF_SS_TX2_RTRANS1_TX2_SS_RTRANS4_POS                                                           (0UL)
#define CLIF_SS_TX2_RTRANS1_TX2_SS_RTRANS4_MASK                                                          (0x000000FFUL)  /**< 0-TX2 rising transition value 4*/

#define CLIF_SS_TX2_RTRANS2                                                                               0x86
#define CLIF_SS_TX2_RTRANS2_TX2_SS_RTRANS11_POS                                                          (24UL)
#define CLIF_SS_TX2_RTRANS2_TX2_SS_RTRANS11_MASK                                                         (0xFF000000UL)  /**< 24-TX2 rising transition value 11*/
#define CLIF_SS_TX2_RTRANS2_TX2_SS_RTRANS10_POS                                                          (16UL)
#define CLIF_SS_TX2_RTRANS2_TX2_SS_RTRANS10_MASK                                                         (0x00FF0000UL)  /**< 16-TX2 rising transition value 10*/
#define CLIF_SS_TX2_RTRANS2_TX2_SS_RTRANS9_POS                                                           (8UL)
#define CLIF_SS_TX2_RTRANS2_TX2_SS_RTRANS9_MASK                                                          (0x0000FF00UL)  /**< 8-TX2 rising transition value 9*/
#define CLIF_SS_TX2_RTRANS2_TX2_SS_RTRANS8_POS                                                           (0UL)
#define CLIF_SS_TX2_RTRANS2_TX2_SS_RTRANS8_MASK                                                          (0x000000FFUL)  /**< 0-TX2 rising transition value 8*/

