QinYuan0618/stm32l431_pn5180/Core/pn5180/library/intfs/phhalHw_Pn5190_Reg.h
#define CLIF_SS_TX2_RTRANS3                                                                               0x87
#define CLIF_SS_TX2_RTRANS3_TX2_SS_RTRANS15_POS                                                          (24UL)
#define CLIF_SS_TX2_RTRANS3_TX2_SS_RTRANS15_MASK                                                         (0xFF000000UL)  /**< 24-TX2 rising transition value 15*/
#define CLIF_SS_TX2_RTRANS3_TX2_SS_RTRANS14_POS                                                          (16UL)
#define CLIF_SS_TX2_RTRANS3_TX2_SS_RTRANS14_MASK                                                         (0x00FF0000UL)  /**< 16-TX2 rising transition value 14*/
#define CLIF_SS_TX2_RTRANS3_TX2_SS_RTRANS13_POS                                                          (8UL)
#define CLIF_SS_TX2_RTRANS3_TX2_SS_RTRANS13_MASK                                                         (0x0000FF00UL)  /**< 8-TX2 rising transition value 13*/
#define CLIF_SS_TX2_RTRANS3_TX2_SS_RTRANS12_POS                                                          (0UL)
#define CLIF_SS_TX2_RTRANS3_TX2_SS_RTRANS12_MASK                                                         (0x000000FFUL)  /**< 0-TX2 rising transition value 12*/

#define CLIF_SS_TX1_FTRANS0                                                                               0x88
#define CLIF_SS_TX1_FTRANS0_TX1_SS_FTRANS3_POS                                                           (24UL)
#define CLIF_SS_TX1_FTRANS0_TX1_SS_FTRANS3_MASK                                                          (0xFF000000UL)  /**< 24-TX1 falling transition value 3*/
#define CLIF_SS_TX1_FTRANS0_TX1_SS_FTRANS2_POS                                                           (16UL)
#define CLIF_SS_TX1_FTRANS0_TX1_SS_FTRANS2_MASK                                                          (0x00FF0000UL)  /**< 16-TX1 falling transition value 2*/
#define CLIF_SS_TX1_FTRANS0_TX1_SS_FTRANS1_POS                                                           (8UL)
#define CLIF_SS_TX1_FTRANS0_TX1_SS_FTRANS1_MASK                                                          (0x0000FF00UL)  /**< 8-TX1 falling transition value 1*/
#define CLIF_SS_TX1_FTRANS0_TX1_SS_FTRANS0_POS                                                           (0UL)
#define CLIF_SS_TX1_FTRANS0_TX1_SS_FTRANS0_MASK                                                          (0x000000FFUL)  /**< 0-TX1 falling transition value 0*/

#define CLIF_SS_TX1_FTRANS1                                                                               0x89
#define CLIF_SS_TX1_FTRANS1_TX1_SS_FTRANS7_POS                                                           (24UL)
#define CLIF_SS_TX1_FTRANS1_TX1_SS_FTRANS7_MASK                                                          (0xFF000000UL)  /**< 24-TX1 falling transition value 7*/
#define CLIF_SS_TX1_FTRANS1_TX1_SS_FTRANS6_POS                                                           (16UL)
#define CLIF_SS_TX1_FTRANS1_TX1_SS_FTRANS6_MASK                                                          (0x00FF0000UL)  /**< 16-TX1 falling transition value 6*/
#define CLIF_SS_TX1_FTRANS1_TX1_SS_FTRANS5_POS                                                           (8UL)
#define CLIF_SS_TX1_FTRANS1_TX1_SS_FTRANS5_MASK                                                          (0x0000FF00UL)  /**< 8-TX1 falling transition value 5*/
#define CLIF_SS_TX1_FTRANS1_TX1_SS_FTRANS4_POS                                                           (0UL)
#define CLIF_SS_TX1_FTRANS1_TX1_SS_FTRANS4_MASK                                                          (0x000000FFUL)  /**< 0-TX1 falling transition value 4*/

#define CLIF_SS_TX1_FTRANS2                                                                               0x8A
#define CLIF_SS_TX1_FTRANS2_TX1_SS_FTRANS11_POS                                                          (24UL)
#define CLIF_SS_TX1_FTRANS2_TX1_SS_FTRANS11_MASK                                                         (0xFF000000UL)  /**< 24-TX1 falling transition value 11*/
#define CLIF_SS_TX1_FTRANS2_TX1_SS_FTRANS10_POS                                                          (16UL)
#define CLIF_SS_TX1_FTRANS2_TX1_SS_FTRANS10_MASK                                                         (0x00FF0000UL)  /**< 16-TX1 falling transition value 10*/
#define CLIF_SS_TX1_FTRANS2_TX1_SS_FTRANS9_POS                                                           (8UL)
#define CLIF_SS_TX1_FTRANS2_TX1_SS_FTRANS9_MASK                                                          (0x0000FF00UL)  /**< 8-TX1 falling transition value 9*/
#define CLIF_SS_TX1_FTRANS2_TX1_SS_FTRANS8_POS                                                           (0UL)
#define CLIF_SS_TX1_FTRANS2_TX1_SS_FTRANS8_MASK                                                          (0x000000FFUL)  /**< 0-TX1 falling transition value 8*/

#define CLIF_SS_TX1_FTRANS3                                                                               0x8B
#define CLIF_SS_TX1_FTRANS3_TX1_SS_FTRANS15_POS                                                          (24UL)
#define CLIF_SS_TX1_FTRANS3_TX1_SS_FTRANS15_MASK                                                         (0xFF000000UL)  /**< 24-TX1 falling transition value 15*/
#define CLIF_SS_TX1_FTRANS3_TX1_SS_FTRANS14_POS                                                          (16UL)
#define CLIF_SS_TX1_FTRANS3_TX1_SS_FTRANS14_MASK                                                         (0x00FF0000UL)  /**< 16-TX1 falling transition value 14*/
#define CLIF_SS_TX1_FTRANS3_TX1_SS_FTRANS13_POS                                                          (8UL)
#define CLIF_SS_TX1_FTRANS3_TX1_SS_FTRANS13_MASK                                                         (0x0000FF00UL)  /**< 8-TX1 falling transition value 13*/
#define CLIF_SS_TX1_FTRANS3_TX1_SS_FTRANS12_POS                                                          (0UL)
#define CLIF_SS_TX1_FTRANS3_TX1_SS_FTRANS12_MASK                                                         (0x000000FFUL)  /**< 0-TX1 falling transition value 12*/

#define CLIF_SS_TX2_FTRANS0                                                                               0x8C
#define CLIF_SS_TX2_FTRANS0_TX2_SS_FTRANS3_POS                                                           (24UL)
#define CLIF_SS_TX2_FTRANS0_TX2_SS_FTRANS3_MASK                                                          (0xFF000000UL)  /**< 24-TX2 falling transition value 3*/
#define CLIF_SS_TX2_FTRANS0_TX2_SS_FTRANS2_POS                                                           (16UL)
#define CLIF_SS_TX2_FTRANS0_TX2_SS_FTRANS2_MASK                                                          (0x00FF0000UL)  /**< 16-TX2 falling transition value 2*/
#define CLIF_SS_TX2_FTRANS0_TX2_SS_FTRANS1_POS                                                           (8UL)
#define CLIF_SS_TX2_FTRANS0_TX2_SS_FTRANS1_MASK                                                          (0x0000FF00UL)  /**< 8-TX2 falling transition value 1*/
#define CLIF_SS_TX2_FTRANS0_TX2_SS_FTRANS0_POS                                                           (0UL)
#define CLIF_SS_TX2_FTRANS0_TX2_SS_FTRANS0_MASK                                                          (0x000000FFUL)  /**< 0-TX2 falling transition value 0*/

#define CLIF_SS_TX2_FTRANS1                                                                               0x8D
#define CLIF_SS_TX2_FTRANS1_TX2_SS_FTRANS7_POS                                                           (24UL)
#define CLIF_SS_TX2_FTRANS1_TX2_SS_FTRANS7_MASK                                                          (0xFF000000UL)  /**< 24-TX2 falling transition value 7*/
#define CLIF_SS_TX2_FTRANS1_TX2_SS_FTRANS6_POS                                                           (16UL)
#define CLIF_SS_TX2_FTRANS1_TX2_SS_FTRANS6_MASK                                                          (0x00FF0000UL)  /**< 16-TX2 falling transition value 6*/
#define CLIF_SS_TX2_FTRANS1_TX2_SS_FTRANS5_POS                                                           (8UL)
#define CLIF_SS_TX2_FTRANS1_TX2_SS_FTRANS5_MASK                                                          (0x0000FF00UL)  /**< 8-TX2 falling transition value 5*/
#define CLIF_SS_TX2_FTRANS1_TX2_SS_FTRANS4_POS                                                           (0UL)
#define CLIF_SS_TX2_FTRANS1_TX2_SS_FTRANS4_MASK                                                          (0x000000FFUL)  /**< 0-TX2 falling transition value 4*/

#define CLIF_SS_TX2_FTRANS2                                                                               0x8E
#define CLIF_SS_TX2_FTRANS2_TX2_SS_FTRANS11_POS                                                          (24UL)
#define CLIF_SS_TX2_FTRANS2_TX2_SS_FTRANS11_MASK                                                         (0xFF000000UL)  /**< 24-TX2 falling transition value 11*/
#define CLIF_SS_TX2_FTRANS2_TX2_SS_FTRANS10_POS                                                          (16UL)
#define CLIF_SS_TX2_FTRANS2_TX2_SS_FTRANS10_MASK                                                         (0x00FF0000UL)  /**< 16-TX2 falling transition value 10*/
#define CLIF_SS_TX2_FTRANS2_TX2_SS_FTRANS9_POS                                                           (8UL)
#define CLIF_SS_TX2_FTRANS2_TX2_SS_FTRANS9_MASK                                                          (0x0000FF00UL)  /**< 8-TX2 falling transition value 9*/
#define CLIF_SS_TX2_FTRANS2_TX2_SS_FTRANS8_POS                                                           (0UL)
#define CLIF_SS_TX2_FTRANS2_TX2_SS_FTRANS8_MASK                                                          (0x000000FFUL)  /**< 0-TX2 falling transition value 8*/

#define CLIF_SS_TX2_FTRANS3                                                                               0x8F
#define CLIF_SS_TX2_FTRANS3_TX2_SS_FTRANS15_POS                                                          (24UL)
#define CLIF_SS_TX2_FTRANS3_TX2_SS_FTRANS15_MASK                                                         (0xFF000000UL)  /**< 24-TX2 falling transition value 15*/
#define CLIF_SS_TX2_FTRANS3_TX2_SS_FTRANS14_POS                                                          (16UL)
#define CLIF_SS_TX2_FTRANS3_TX2_SS_FTRANS14_MASK                                                         (0x00FF0000UL)  /**< 16-TX2 falling transition value 14*/
#define CLIF_SS_TX2_FTRANS3_TX2_SS_FTRANS13_POS                                                          (8UL)
#define CLIF_SS_TX2_FTRANS3_TX2_SS_FTRANS13_MASK                                                         (0x0000FF00UL)  /**< 8-TX2 falling transition value 13*/
#define CLIF_SS_TX2_FTRANS3_TX2_SS_FTRANS12_POS                                                          (0UL)
#define CLIF_SS_TX2_FTRANS3_TX2_SS_FTRANS12_MASK                                                         (0x000000FFUL)  /**< 0-TX2 falling transition value 12*/

#ifdef __cplusplus
} /* Extern C */
#endif

#endif  /* NXPBUILD__PHHAL_HW_PN5190 */
#endif /* PHHALHW_PN5190_REG_H_ */
